[{"content": "\n\n\n\n\n\n\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Software provider Quickheal Technologies, which raised Rs 451 crore through its initial public offer (IPO), will list shares on the stock exchanges on Thursday.\r\nThe equity shares will be listed on the NSE as well as on the BSE.\r\nThe IPO, which closed on February 10 was oversubscribed 11 times at a price band of Rs 311-321 per share.\r\nThe IPO consisted of fresh issue of Rs 250 crore and an offer for sale of about 62.70 lakh equity shares by promoters Kailash Sahebrao Katkar and Sanjay Sahebrao Katkar, as well as Sequoia Capital India Investment Holdings III.\r\nThe portion set aside for qualified institutional buyers (QIBs) was subscribed 4.34 times, while retail investors saw 3.8 times subscription.\r\nMeanwhile, non-institutional investors category was subscribed a whopping 36.7 times.\r\nQuick Heal had raised Rs 133.9 crore through issue of shares to 10 anchor investors.\r\nICICI Securities, Jefferies India and JPMorgan India were the book running lead managers while Link Intime India was the registrar to the public issue.\r\nWhile the proceeds from the offer of sale would not go to Quick Heal Technologies, the Rs 250-crore funds raised from fresh issue of equity shares would be used by the company for advertising and sales promotion and capital expenditure for research and development.\r\nThe proceeds would also be invested to purchase, develop and renovate its office premises in Kolkata, Pune and New Delhi, as well as for general corporate needs.\r\nThe company is a provider of software security products and solutions in India. $(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "16 Feb,2016 2131hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/q/quickheal_3854_356.jpg", "description": "Software provider Quickheal\r\nTechnologies, which raised Rs 451 crore through its initial\r\npublic offer (IPO), will list shares on the stock exchanges on\r\nThursday.", "title": "Quickheal to list shares on Feb 18  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Rahul Mohindar of viratechindia.com told CNBC-TV18, \"One can buy  Axis Bank   with a target of Rs 430 and a stop loss at Rs 397.\"\"One can also buy  Tata Consultancy Services   with a target of Rs 2,350 keeping a stop loss at Rs 2,230,\" he said.Ashwani Gujral of ashwanigujral.com recommends selling  Motherson Sumi Systems   with a target of Rs 215 and a stop loss at Rs 230 and  Power Finance Corporation   with a target of Rs 135 keeping a stop loss at Rs 149.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "16 Feb,2016 1600hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/m/mkt1_2347_356.jpg", "description": "Rahul Mohindar of viratechindia.com recommends buying Axis Bank and Tata Consultancy Services.", "title": "Buy Axis Bank, Tata Consultancy Services: Rahul Mohindar  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Manish Sharma of Derivative Trading Research told CNBC-TV18, \" Hotel Leela   is trading with a positive bias and still looking strong on the daily and weekly charts. The stock is trading at a crucial support level of around Rs 17, which is also a 50-day moving average (DMA) of the stock. So trading with a positive bias, one can definitely hold the long positions with a strict stop loss at Rs 15 and look for the target of around Rs 25 with a one year timeframe.\"At 15:08 hrs Hotel Leela Venture was quoting at Rs 17.20, down Rs 0.30, or 1.71 percent. It has touched an intraday high of Rs 17.65 and an intraday low of Rs 17.05.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "16 Feb,2016 1515hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/h/hotel_leela_0812_356.jpg", "description": "Manish Sharma of Derivative Trading Research is of the view that one can hold Hotel Leela.", "title": "Hold Hotel Leela, says Manish Sharma  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Ashwani Gujral of ashwanigujral.com told CNBC-TV18, \"Today the market breath is quite a bit negative and a lot of these midcap stocks are coming under pressure. So, for the day,  Canara Bank   is a sell with a stop loss of Rs 176 for target of Rs 164.\"\" Engineers India   also is unable to continue its pull back, so this is a sell with stop loss of Rs 155 for target of Rs 142,\" he said.\"Possibly  Cairn India   should have some upside, so this is a buy with a stop loss of Rs 123 for target of Rs 137.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "16 Feb,2016 1500hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/buy-sell1_200_0310_356.jpg", "description": "Ashwani Gujral of ashwanigujral.com recommends selling Canara Bank and Engineers India and advises buying Cairn India.", "title": "Sell Canara Bank, Engineers India; buy Cairn India: Ashwani Gujral  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Ashwani Gujral of ashwanigujral.com told CNBC-TV18, \" HDIL   is clearly collapsing, so that is a sell with a stop loss of about Rs 62 and we should look for targets now closer to Rs 54. Basically, with this kind of momentum everything that went up 6-8 percent and real estate index was the third best performer up about 7 percent, so all those gains will get taken away. So, any real estate stock which is in the F&O, I think should do fairly badly.\"\"Interestingly  SKS Microfinance   hasn't fallen a whole lot. It has infact outperformed. Now all of these outperformers are coming under pressure. SKS Micro is a sell with a stop loss of Rs 501 with a target of Rs 480,\" he said.\" Union Bank   will also give up all of its gains from yesterday. So, that is a sell with a stop loss of Rs 116 with target of Rs 104.\"\"Everything is going down.However F&O stocks have their own issues with short positions etc. I think  Jet Airways   can go towards Rs 430-440 where it had significant tops earlier on. So, support is at lower levels around Rs 430-440 but as we have seen people got skewed with  BPCL  ,  HPCL   and aviation that now when these stocks are going to come down they will also come down in a heap.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "16 Feb,2016 1618hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/s/Sell_16-9_356x200_0717_356.jpg", "description": "Ashwani Gujral of ashwanigujral.com recommends selling HDIL, SKS Microfinance and Union Bank.", "title": "Sell HDIL, SKS Microfinance, Union Bank: Ashwani Gujral  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Krish Subramanyam of Altamount Capital told CNBC-TV18, \"In today's session, we have seen some pretty strong short built up in  Arvind  . Last time also it was almost up to 14 percent. So, some sort of pressure is building up in the counter and probably could be heading higher. But we are recommending some sort of covered Put strategy wherein one could sell the Arvind Futures, that is around Rs 286, but also sell a 270 strike Put that is quoting at around Rs 5. We are keeping a target of Rs 275 and a stop loss of Rs 292.\"\"One can sell  Dish TV  . The counter has actually seen some pretty aggressive shorts in the last few days and it has also breached certain levels. It is also a modest bounce back in the last couple of days, but it looks like it might give up some of those gains again. So, a modest downside could be expected, because it has lost quite substantially. So, a modest downside could be expected. We are keeping a target of around Rs 72 and a stop loss of 77,\" he said. \"The last stock is a buy on  Apollo Tyres   which has seen some very good rallies in the last few days. So, one could possibly do sort of a covered Call strategy wherein one could buy Futures at Rs 155 and slso sell 155 strike Call at around Rs 5 keeping a modest target of Rs 162 and a stop loss of Rs 151.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "16 Feb,2016 1510hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/s/stocks_16-9_356x200_0445_356.jpg", "description": "Krish Subramanyam of Altamount Capital recommends selling Apollo Tyres futures and 270 Put and advises buying Apollo Tyres.", "title": "Sell Arvind futures, 270 Put; buy Apollo Tyres: Krish Subramanyam  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Mayuresh Joshi of Angel Broking told CNBC-TV18, \"Clearly the doubt still persists in terms of how the energy and crude prices are moving at this point of time and execution again has been a sort of a deterrent for the  Larsen and Toubro   (L&T) from a medium-term perspective. However, having said that, the order book is quite robust, close to Rs 2,56,000 crore odd. So, that gives decent revenue visibility. You are talking about the networking capital cycle actually getting peaked off around 24-25 percent mark.\"\"I think the negatives that the stock carries along with the entire sector is the kind of order flows that one really expects to be very tepid over the next few quarters, execution again is going to be extremely key. Clearly, if you are talking about a slowdown happening, the hydrocarbons business might have some amount of issues but it has been strongly resilient over the last few quarters,\" he said.\"So, what L&T has apart from its standalone engineering and hydrocarbons division is its IT business as well. So, any listing there off over the next few quarters, what it does with its real estate arm, the SOTP valuation also taking into account, the finance arm that L&T has got in terms of  L&T Finance Holdings  , clearly I think you are talking about a company which is in the right scheme of things for the Indian economy.\" \"We are not seeing the right moves in terms of the credit cycle and that is why the tepidness probably in a lot of these stocks, it might for all eventuality along with the markets correct another 10-12 percent from the current level but in my opinion that gives a better entry point for the investor. You should have a longer time horizon of a year, year and a half to say the least.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "16 Feb,2016 1525hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/l/Larsen_4724_356.jpg", "description": "Mayuresh Joshi of Angel Broking is of the view that one may prefer Larsen and Toubro for long term.", "title": "Prefer L&T for long term: Mayuresh Joshi  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Edelweiss's research report on  Aarti Industries Aarti Industries’ (AIL) Q3FY16 revenues at INR6.8bn came 4% above our estimate. EBITDA at INR1.3bn jumped 26% YoY driven by continued strong performance in speciality chemical segment, which reported 15% YoY volume growth. While pharma performance was satisfactory, home & personal care (HPC) suffered an operating loss driven by certain one offs. With capacities to be commissioned over FY17, management is confident of achieving guidance of 20-24% PAT CAGR over the next 3-4 years. As we roll forward to FY18E, we maintain our PE at 14.0x giving us a revised target price of INR613 (INR529 earlier). Maintain ‘BUY. AIL’s expansion plans provide revenue and earnings visibility and management has maintained its revenue/PAT growth guidance of 15-20%/20-24% over the next 3-4 years, led by higher volumes. As we roll forward to FY18E, we maintain our PE at 14.0x giving us a revised target price of INR613 (INR529 earlier). We maintain ‘BUY’. Demerger of pharma segment will further unlock value for share holders. \nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "12 Feb,2016 1715hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/a/Aarti_Industries_4748_356.jpg", "description": "Edelweiss is bullish on Aarti Industries has recommended buy rating on the stock with a target price of Rs 613 in its research report dated February 9, 2016.", "title": "Buy Aarti Industries; target of Rs 613: Edelweiss  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Edelweiss's research report on  Dr Reddys Labs Dr Reddy’s (DRRD) Q3FY16 revenue/EBITDA/PAT grew 3%/12%/1%. While US grew 10% in CC terms and India’s organic growth was ~19%, currency headwinds hurt growth in Russia and emerging markets (Ems). Even when DRRD guided for better US launches in FY17 versus FY16, it hinted at tougher times ahead. We believe the time for currency woes to translate into significant challenges in conducting business in Russia and Venezuela has arrived. On the Warning Letter front, DRRD submitted CAPA commitments to FDA in Dec’15 and believes it can accomplish its work on its own end in next 5‐6 months. We maintain ‘HOLD’. While we believe DRRD’s complex generic pipeline could unfold a number of niche opportunities, the numerous near term issues pose risks to earnings. Given the significant risks to branded business in Venezuela and Russia, we rationalise our target multiple to 18x (20x earlier) and our new TP is INR3,120. Maintain ‘HOLD/SP’. \nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "12 Feb,2016 1716hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/d/Dr_Reddy_3651_356.jpg", "description": "Edelweiss has recommended hold rating on Dr Reddys Labs with a target price of Rs 3120 in its research report dated February 10, 2016.", "title": "Hold Dr Reddys Labs; target of Rs 3120: Edelweiss  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}CNBC-TV18s Varinder Bansal lists some of the key stocks which were buzzing in trade today.\nWatch video for more... $(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "15 Feb,2016 1606hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/v/varinder_356_30dec_2601_356.jpg", "description": "CNBC-TV18s Varinder Bansal lists some of the key stocks which were buzzing in trade today.", "title": "Stocks that were buzzing in trade today  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Gaurav Bissa -Derivatives Analyst at LKP Securities told CNBC-TV18, \" Engineers India   (EIL) have seen good amount of shorts, good amount of short covering is seen getting built up and today some fresh longs were getting added. Some out of the money call option has seen good amount of buying. The expectations are that the stock might test levels of Rs 168-170 in next two or three trading sessions. One can now have a stop loss at Rs 155-156 and play for targets of Rs 162-170.\"\" Siemens   was falling more on the account of long unwinding, I would say not a continuous process. It has to be absorbed somewhere and that is what we have seen in last few trading sessions. The level of Rs 1,000 is the level from where the longs have started getting build up. This time also it has taken a support at Rs 1,000-1,020 and we are seeing fresh intraday longs. So, I would recommend going long for a targets of Rs 1,075. It has moved up a bit, one can now have stop loss at Rs 1,010-1,015,\" he added.\"Last recommendation would be sell on  Strides Shasun  . Consistent long unwinding intraday shorts are seeing getting build; 1,000 Put option had one of these highest concentration and is trading below that. So, until and unless it is trading above Rs 1,020-1,030, short covering is going to be very difficult in this stock or rather fresh buying would not be advised. I would recommend going short for target of Rs 930 and have a stop loss at Rs 1,025.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "15 Feb,2016 1502hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/buy-sell_190_0400_356.jpg", "description": "Gaurav Bissa -Derivatives Analyst at LKP Securities recommends going long in Siemens and advises selling Strides Shasun.", "title": "Go long in Siemens, sell Strides Shasun: Gaurav Bissa  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Watch the interview of Rajat Bose of rajatkbose.com, Prakash Gaba of prakashgaba.com, Ashwani Gujral of ashwanigujral.com, Prakash Diwan of prakashdiwan.in, and Siddarth Bhamre, Head Equity Derivatives at Angel Broking with Latha Venkatesh and Sonia Shenoy on CNBC-TV18, in which they shared their readings and outlook on market technicals, fundamentals and F&O side of the market as well as specific stocks and sectors. $(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "16 Feb,2016 0945hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2016/356x200/b/Budget_markets_bse_nse_sensex_stock_market_356x200_1759_356.jpg", "description": "Watch the interview of Rajat Bose of rajatkbose.com, Prakash Gaba of prakashgaba.com, Ashwani Gujral of ashwanigujral.com, Prakash Diwan of prakashdiwan.in, and Siddarth Bhamre, Head Equity Derivatives at Angel Broking with Latha Venkatesh and Sonia Shenoy on CNBC-TV18.", "title": "Here are some top trading tips from market experts  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Gaurav Bissa of LKP Securities told CNBC-TV18, \"There are multiple negative for  ITC  , 300 Put option has the highest concentration of short positions. That will act as immediate support. It might be preempting at these levels; if it is crossing Rs 300 then there are chances it may fall towards Rs 285 in a short span of time and will be breakdown as well. I am going with a safer strategy. Just buy 300 strike Put option for target of Rs 10 keeping the stop loss at Rs 2.\"At 12:35 hrs ITC was quoting at Rs 302.35, down Rs 1.35, or 0.44 percent. It has touched an intraday high of Rs 305.90 and an intraday low of Rs 300.90.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "16 Feb,2016 1240hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2016/356x200/i/ITC_356x200_2322_356.jpg", "description": "Gaurav Bissa of LKP Securities is of the view that one can buy ITC 300 Put.", "title": "Buy ITC 300 Put, says Gaurav Bissa  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Prabhudas Lilladher's research report on  ACC  ACC reported earnings for Q4CY15 above our expectation on the back of lower than expected energy and freight costs. We expect sustainable reduction in costs on the back of shift to pet coke (likely to reach to 50% by Q4CY16 end against existing 10%), commissioning of modernised facility at Jamul (its share at 13% of CY16 capacity) and rationalisation of freight cost. Driven by improved quality of operations, we maintain our BUY rating with TP of Rs1600, EV/T of US$130 CY16E capacity of 33m tonnes. ACC underperformed its peers for a considerable period due to its high cost operations. ACC is addressing its high costs with the modernisation of old and obsolete plants, increased usage of pet coke/alternate fuel and rationalisation of freight cost. We expect continuous reduction in costs over the next 12 months on the back of elevated capacity utilisation and commissioning of modernisation projects. Controlled costs and improved outlook on demand drive our strong estimates for CY16‐CY17 projecting ~36% CAGR growth in EPS. CY16 would have the partial benefit of new 2.8m t clinker line in Jamul (Chhattisgarh) and higher usage of pet coke. \nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "12 Feb,2016 1716hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/a/ACC_4215_356.png", "description": "Prabhudas Lilladher is bullish on ACC has recommended buy rating on the stock with a target price of Rs 1600 in its research report dated Februrary 10, 2016.", "title": "Buy ACC; target of Rs 1600: Prabhudas Lilladher  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Ashwani Gujral, Fund Manager at ashwanigujral.com told CNBC-TV18, \"The IT index is looking fairly weak and  Mindtree   often has trouble around Rs 1,500. So this is a sell with a stop loss of Rs 1,450 for target of Rs 1,375.\"\" NTPC   is showing lots of strength. Public sector undertakings (PSU) and energy in general are doing that. So that is a buy with a stop of Rs 126 with target of Rs 138,\" he added.\" Ceat   has broken out of some sort of a Rs 50-70 point range. That is a buy with a stop of Rs 975 with target of Rs 1,010.\"\" Idea Cellular   seems to have made some sort of important low around Rs 98-100. So maybe it is a preferred stock but overall these telecom stocks haven’t participated in this pullback and hence they appear more range bound than anything else. Now going into the Budget, you should focus more on policy sensitive stocks, PSUs and defence stocks, those kinds of images. I don’t think just random stocks are likely to do too much.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "16 Feb,2016 1250hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/buy-sell_190_0400_356.jpg", "description": "Ashwani Gujral, Fund Manager at ashwanigujral.com recommends selling Mindtree and advises buying NTPC and Ceat.", "title": "Sell Mindtree; buy NTPC, Ceat: Ashwani Gujral  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}In an interview to CNBC-TV18's Nigel D'Souza & Reema Tendulkar, Ashwani Gujral of ashwanigujral.com shared his readings and outlook on market and specific stocks and Chandan Taparia of Anand Rathi Securities gave his outlook on Futures and Options (F&O) side of the market, specific stocks and sectors.For entire interview, watch video for more $(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "16 Feb,2016 1335hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2016/356x200/b/Budget_markets_bse_nse_sensex_stock_market_356x200_1759_356.jpg", "description": "In an interview to CNBC-TV18's Nigel D'Souza & Reema Tendulkar, Ashwani Gujral of ashwanigujral.com shared his readings and outlook on market and specific stocks and Chandan Taparia of Anand Rathi Securities gave his outlook on Futures and Options (F&O) side of the market, specific stocks and sectors.", "title": "Here are Ashwani Gujral & Chandan Taparia's top picks  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Gaurav Bissa of LKP Securities told CNBC-TV18, \"One can buy  SKS Microfinance  . It has seen decent amount of short covering and if you see the options data for last few series, 520 Call option had one of the highest concentration that was acting as a deterrent. If you are talking of two-three series, the relevance reduces for one particular strike. However, it still remains there, so as long as it trades above Rs 520-525 the next leg of short covering can be seen in this stock and above Rs 535-540 I anticipate fresh longs. Those are the levels from where we saw aggressive longs coming in which took the stock towards Rs 565-570 levels. Similar can be expected in this stock, I recommend going long on 560 Call for target of Rs 15 and one can have a stop loss at Re 1.\"At 12:39 hrs SKS Microfinance was quoting at Rs 510.00, down Rs 14.40, or 2.75 percent. It has touched an intraday high of Rs 533.00 and an intraday low of Rs 508.60.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "16 Feb,2016 1245hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/s/SKS_Microfinance_0740_356.jpg", "description": "Gaurav Bissa of LKP Securities is of the view that one can buy SKS Microfinance 560 Call.", "title": "Buy SKS Microfinance 560 Call, advises Gaurav Bissa  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Emkay's research report on  HSIL Healthy quarter – Revenues up 9.5% at Rs 5.1bn, EBITDA grew 1.1% yoy to Rs 954mn, EBITDA margin at 18.8% down 160bps yoy and APAT at Rs 370mn, up 22% yoy Building products grew by 17.3% aided by consumer product and healthy uptick in faucets; Retail segment seeing steady growth however industrial bleeding. Packaging products reports steady revenue despite a high base EBITDA margins decline 160bps yoy to 18.8% impacted due to unfavorable mix. Lower fuel cost benefit channelized on Ad spend and distribution spends in consumer appliances Cut FY17 earnings by 4% factoring lower margins due to spends in consumer appliances segment. Penetration of faucets and consumer appliances are revenue drivers. Retain BUY with revised price target of Rs 370/share\nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "12 Feb,2016 1712hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/h/HSIL_3056_356.jpg", "description": "Emkay is bullish on HSIL has recommended buy rating on the stock with a target price of Rs 370 in its research report dated February 3, 2016.\r\n", "title": "Buy HSIL; target of Rs 370: Emkay  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Watch the interview of Mayuresh Joshi of Angel Broking and Manish Sharma of Derivative Trading Research with Surabhi Upadhyay & Nigel D'Souza on CNBC-TV18, in which they shared their reading and outlook on market and specific stocks.\r\n  $(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "16 Feb,2016 1500hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/s/stocks_16-9_356x200_0445_356.jpg", "description": "Watch the interview of Mayuresh Joshi of Angel Broking and Manish Sharma of Derivative Trading Research with Surabhi Upadhyay & Nigel D'Souza on CNBC-TV18, in which they shared their reading and outlook on market and specific stocks.", "title": "Investment ideas, trading strategies by market experts  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Here are a few top buzzing midcap stocks picked by CNBC-TV18's analysts in trade today. We have  SBI  ,  Den Networks  ,  Punj Lloyd  ,  Kesoram Industries  ,  Valecha Engineering  ,  Opto Circuits  , and  PNB  .Watch videos for more$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "16 Feb,2016 1331hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/m/mkt_5653_356.jpg", "description": "Here are a few top buzzing midcap stocks picked by CNBC-TV18's analysts in trade today. We have SBI, Den Networks, Punj Lloyd, Kesoram Industries, Valecha Engineering, Opto Circuits, and PNB.", "title": "Top buzzing midcap stocks to trade on February 16  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Kunal Bothra of LKP Securities told CNBC-TV18, \"One can buy  Tata Consultancy Services   with a target of Rs 2,350 keeping a stop loss at Rs 2,230 and sell  Bharat Heavy Electricals   with a target of Rs 97 keeping a stop loss at Rs 107.\"Ashwani Gujral of ashwanigujral.com recommends buying  Cairn India   with a target of Rs 138 and a stop loss at Rs 125 and advises selling  Arvind   with a target of Rs 268 keeping a stop loss at Rs 285.\"\"One can also buy  NTPC   with a target of Rs 138 and a stop loss at Rs 126 and advises selling  Bharti Infratel   with a target of Rs 354 keeping a stop loss at Rs 372 and  Cipla   with a target of Rs 500 keeping a stop loss at Rs 530,\" he said.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "16 Feb,2016 1520hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/buy-sell_190_0400_356.jpg", "description": "Kunal Bothra of LKP Securities recommends buying TCS and advises selling BHEL.", "title": "Buy TCS, sell BHEL: Kunal Bothra  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Ashwani Gujral of ashwanigujral.com told CNBC-TV18, \"Midcap pharmaceutical is really under pressure. So,  Torrent Pharma   is a sell with a stop loss of Rs 1,270 for target of Rs 1,200.\" \" Bank of Baroda   (BoB), if you did not buy it yesterday, today it is giving an opportunity to buy. So, maybe you can try to buy this with a stop loss of say around Rs 128 and look for targets of Rs 145,\" he said. \"You can sell  Voltas   with a stop loss of Rs 232 for target of Rs 216.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "16 Feb,2016 1346hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/buy-sell_190_0400_356.jpg", "description": "Ashwani Gujral of ashwanigujral.com recommends selling Torrent Pharma and Voltas and advises buying Bank of Baroda.", "title": "Sell Torrent Pharma, Voltas; buy Bank of Baroda: Ashwani Gujral  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Sudarshan Sukhani of s2analytics.com told CNBC-TV18, \"I am not suggesting  Bata India   as a day trade but if you are wanting to take even a trade for a few days or weeks, I would say Bata at current level is a buying opportunity. Whenever the market rallies and remember the markets will rally, we just don’t know when, Bata will outperform.\" \" Glenmark Pharma   is going down. The stocks that are going down are unlikely to start a spring or an upmove without stopping, without building a base. Glenmark is still continuing down and pharmaceutical as a theme is distributing, so Glenmark is a short sell,\" he said. \" Steel Authority of India   (SAIL) is an easier short call. SAIL, sometimes I wonder, it is at Rs 37, how low can it go. However, I thought of it at Rs 60 also and it has told us how low it can go. It is a short sell. A lot of these stocks are probably coming to the lowest levels. So, traders must understand that if they are making money, they should also get out and take the profits.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "11 Feb,2016 0935hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/f/fund_manager_with_buy_sell_long_short_356X200_4349_356.jpg", "description": "Sudarshan Sukhani of s2analytics.com recommends buying Bata India and advises selling Glenmark and SAIL.", "title": "Buy Bata India; sell Glenmark, SAIL: Sudarshan Sukhani  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Sudarshan Sukhani of s2analytics.com told CNBC-TV18, \"Look at the charts of  SKS Microfinance  ; it is a beauty. The Nifty is falling and SKS Micro is doing exactly the opposite and rallying. Buy the stock and hold it.\" \"In  Tata Motors   and  Ashok Leyland   I am a short seller. Tata Motors has been a consistent short sell and Ashok Leyland is now breaking down. It has already confirmed a distribution,\" he said.\"In  Hero Motocorp  , I would be a buyer. There is no sense in buying in this falling and declining market. However, the view is that if there is an opportunity, I would like to buy it.\"\"I would trade  Cipla   on the short side. They are not day trades but the stock is giving a sense that it is coming down much lower. I have explained earlier that to my reckoning, a lot of pharmaceutical stocks are making distribution pattern. Cipla, inspite of the declines already seen is likely to be a positional short.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "11 Feb,2016 1010hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/buy_sell_2840_356.jpg", "description": "Sudarshan Sukhani of s2analytics.com recommends buying SKS Microfinance and advises selling Tata Motors and Ashok Leyland.", "title": "Buy SKS Microfinance; sell Tata Motors, Ashok Leyland: Sudarshan Sukhani  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Simi Bhaumik of simibhaumik.com told CNBC-TV18, \"I will be playing for a relief rally in  BPCL  . This stock doesn’t look that good but I am expecting a relief rally in it provided it holds above Rs 830-832 range. My stop loss would be below Rs 825 and my targets for the day would be Rs 852-857. The levels of Rs 852-857 would be a major hurdle going forward and unless it clears this range it would again surrender.\"\"If it reaches Rs 852-857 range one should book profits but as of now at dips it may get at around Rs 830-832 range and we can still play a contrarian buying with a stop loss below Rs 825.Intarday targets is Rs 852-857,\" she added.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "11 Feb,2016 1000hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/BPCL_2_3636_356.jpg", "description": "Simi Bhaumik of simibhaumik.com is of the view that one can buy BPCL on dips.", "title": "Buy BPCL on dips: Simi Bhaumik  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Simi Bhaumik of simibhaumik.com told CNBC-TV18, \" GAIL India   on technical parameters is looking excellent I have given a buy call on this stock. I am expecting a rally in this and am expecting a target of Rs 352-357. This stock is actually taking support around Rs 340 range. I would rather wait for a minor dip and go long with a stop loss below Rs 338. My targets on the upside would be Rs 352 and Rs 357. These are intraday target.\"At 09:19 hrs GAIL India was quoting at Rs 347.00, up Rs 1.40, or 0.41 percent. It has touched an intraday high of Rs 347.20 and an intraday low of Rs 342.75.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "11 Feb,2016 0935hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/g/GAIL_0405_356.jpg", "description": "Simi Bhaumik of simibhaumik.com recommends going long in GAIL India on dips for a target of Rs 357.", "title": "Go long in GAIL India on dips, says Simi Bhaumik  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Rajat Bose of rajatkbose.com told CNBC-TV18, \"If you want to short, strategies are plenty.  ITC   looks like heading for Rs 303 and you put a stop loss above Rs 314.20. This is actually an index heavyweight. It can affect the Nifty in a much more magnified fashion compared to Tata Motors which is another selling candidate in my list.\"\" Tata Motors   is also a sell. Put a stop loss above Rs 305.50, target is Rs 291.50. Then there is this housing finance company,  LIC Housing   where Rs 425.10 is the stop loss and target is Rs 409,\" he said.\"One of the better banks,  IndusInd Bank   looks pretty weak.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "10 Feb,2016 1102hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/s/stocks_16-9_356x200_1734_356.jpg", "description": "Rajat Bose of rajatkbose.com recommends selling ITC and Tata Motors and feels that LIC Housing Finance may test Rs 409.", "title": "Sell ITC, Tata Motors; LIC Housing may test Rs 409: Rajat Bose  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Sudarshan Sukhani of s2analytics.com told CNBC-TV18, \"In  State Bank of India   (SBI), there is no early morning trade and especially with results, we wait for analysis of the results before we even make a decision or a chart check. I would not take any trade in it.\"\" Tata Global Beverage   is a positional short sell. It has made a very bearish pattern. So, it is not just for today, you take these positions and hold on,\" he said. \" BEL   is also something very similar. It is making a large bearish pattern. The stock is now making it after the Nifty has fallen so much, lower levels are coming.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "11 Feb,2016 1005hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/t/Tata_Global365_0741_356.jpg", "description": "Sudarshan Sukhani of s2analytics.com recommends selling Tata Global Beverage and feels that BEL may head lower.", "title": "Sell Tata Global Beverage, BEL may head lower: Sudarshan Sukhani  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Sudarshan Sukhani of s2analytics.com told CNBC-TV18, \" CESC   is under pressure but it is not because of the operational results. I only look at the charts and on the charts, it is on the verge of a significant breakdown. Earlier I have suggested that midcaps are now joining the play on the downside. That seems to be becoming real. A lot of midcap opportunities are coming in the F&O segment for shorting. CESC is heading for significantly lower levels.\"\" UPL   is at least better than CESC but the stock had a rally, that rally fizzled out. It is making lower lows consistently and there is a significant resistance that it has not been able to overcome. So I assume that it will just drift lower,\" he said.\" HPCL   is on the verge of making another new low. It is breaking down. There was a sharp correction that seems to be a beginning of a downtrend rather than a correction now. It is not stopping. So both HPCL and BPCL are short selling ideas. I am just taking HPCL today.\"\" Ajanta Pharma   and  Bajaj Auto   are giving bullish patterns and it is a pleasure to see a bullish pattern in this dismal market. So, Ajanta Pharma is on the verge of making a breakout on the upside and it has already gone through a correction, a V-shaped rally has taken place. So, it could easily do its own thing, even when the markets go the other way. So, it is more of a positional trade. You buy and hold it and suffer through any minor setbacks that come.\" \"Bajaj Auto is a short-term trade, you take the trade only if you sense that the stock is going up, but it is giving an impression of breaking on the upside. I do not know why it will do that because it is part of a larger Nifty group.\"\" Oracle Financial Services Software   is falling down. It is making lower highs, lower lows, and it is a blue chip company which is why I am saying, except for  Infosys  , it now appears that IT is ready for a big decline.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "10 Feb,2016 0928hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/s/stocks_16-9_356x200_0445_356.jpg", "description": "Sudarshan Sukhani of s2analytics.com recommends selling CESC and HPCL and feels that UPL may head lower.", "title": "Sell CESC, HPCL; UPL may head lower: Sudarshan Sukhani  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Kunj Bansal of Centrum Wealth Management told CNBC-TV18, \"Results season has in fact largely been in-line with expectations. While the feeling comes that there is too much of negativity that negativity was probably foreseen much earlier except maybe the public sector banking space or even the private sector banking space wherein the non-performing assets have (NPAs) have been higher.\" \"If we scan the result across sectors, two, three stocks particularly in midcap clearly come out which become buy from a medium to long-term perspective. Since I talked of the financial sector, one of them is  L&T Finance Holdings  . So, while in terms of specific stock momentum, it is not showing strength as let us say  Bajaj Finance   or  Capital First   and all but in terms of business growth that we see, the company reported almost 20 percent growth in quarter (Q3). One of the few companies which have reported growths and that too to the extent 18-19 percent in such a scenario wherein not much growth or rather de-growth is being reported,\" he said.\"With the correction that has come in, in last few days and even earlier, this stock is now available at a price to book of 1.2 times. With the market or even otherwise the stock can go down further but leaving aside those short-term movements, I think for a medium to long-term investor, company is worth buying.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "11 Feb,2016 1045hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2016/356x200/r/Rupee_currency_finance_356_1059_356.jpg", "description": "Kunj Bansal of Centrum Wealth Management is of the view that one can buy L&T Finance Holdings with a medium to long term view.", "title": "Buy L&T Finance Holdings for long term: kunj Bansal  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Moneycontrol BureauShares of  Shilpa Medicare   surged 13.5 percent intraday Thursday as it has received compliance letter from United States Food and Drug Administration (USFDA).The company has received compliance letter for both API manufacturing sites located at Deosugur Industrial Area, Deosugur and Raichur Industrial Growth Centre, Chicksugur, Raichur, Karnataka, India.The company is going to announce its December quarter results on February 12, 2016.At 10:32 hrs Shilpa Medicare was quoting at Rs 430, up Rs 13.25, or 3.18 percent on the BSE.Posted by Rakesh Patil$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "11 Feb,2016 1036hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/p/Pharm_medical_drugs_anti_pharma_ceutical_356x200_0539_356.jpg", "description": "Shares of Shilpa Medicare surged 13.5 percent intraday Thursday as it has received compliance letter from United States Food and Drug Administration (USFDA).", "title": "Shilpa Medicare up 13% on USFDA's compliance letter for 2 plants  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Moneycontrol BureauShares of  Dr Reddy's Laboratories   gained 3 percent intraday Thursday. The company is going to consider buyback of equity shares in its meeting to be held on February 17, 2016.Promoter and promoter group held 25.51 percent stake in the company as of September 2015.Additionally, the company's consolidated net profit was up marginally at Rs 579 crore in December quarter compared to Rs 574.5 crore in year-ago period.Prabhudas Lilladher has maintained an accumulate rating with a target price of Rs 3083 and KRChoksey assigned buy rating with a target price of Rs 3610 in its report dated February 10, 2016.At 10:46 hrs Dr Reddy's Laboratories was quoting at Rs 2,936.85, up Rs 50, or 1.73 percent on the BSE.Posted by Rakesh Patil$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "11 Feb,2016 1134hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/s/sun_pharma_3121_356.jpg", "description": "Shares of Dr Reddy's Laboratories gained 3 percent intraday Thursday. The company is going to consider buyback of equity shares in its meeting to be held on February 17, 2016.", "title": "Dr Reddy's Laboratories shares gain 3% on buyback buzz  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Motilal Oswal's research report on  Repco Home Repco’s 3QFY16 PAT grew 25.5% YoY to INR386m (5% beat); strong operating performance was driven by +32% YoY increase in net income and muted opex due to nil ESOP charges. Loan growth (30% YoY), increase in calc. NIMs (7bp YoY) and 30bp YoY increase in NPLs were the key highlights. Business momentum remained strong, with loan book growing a healthy 30% YoY to INR71.5b, whereas sanctions/disbursement also grew at healthy rate of 20/25% respectively. Despite Chennai floods, the growth parameters remained strong. Calculated NIMs improved marginally (7bp YoY) to 4.45%, whereas spreads at 3.07% were up 29bp YoY. Spreads/NIMs improvement was led by a sharp 50bp YoY decline in CoF (led by rating upgrade in the last quarter and reduction in base rates); whereas calc. yields at 12.52% were down 20bp YoY. RHFL has delivered loan book CAGR of 34%+ over FY10-15, with equally impressive earnings growth of 25%. Presence in the underserved markets, pricing power on the asset side, recent rating upgrade (which is likely to lead to lower cost of fund), stringent cost control as well as credit appraisal processes and expanding reach will ensure earnings growth in near to medium term; we expect a healthy 30%+ loan/earnings growth for the next three years. We have marginally revised our FY16 estimates by ~4% and may re-visit the same post the conference call on Thursday, 11th February. Repco is currently trading at 3.5x FY17E BV. Maintain Buy with a TP INR814 (4.5x FY17 BV). \nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "10 Feb,2016 1409hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/buy3_16-9_356x200_0652_356.jpg", "description": "Motilal Oswal is bullish on Repco Home has recommended buy rating on the stock with a target price of Rs 814 in its research report dated February 8, 2016.", "title": "Buy Repco Home; target of Rs 814: Motilal Oswal  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Prabhudas Lilladher's research report on  Sadbhav Engg Sadbhav Engineering (SEL) reported revenues of Rs7.5bn (PLe: Rs8.2bn), up 4% YoY. Revenues from Roads were up 25%, while Irrigation and Mining segment were down 27 and 34% YoY respectively. EBITDA was up 0.6% YoY to Rs739m, though EBITDA margins dipped 40bps YoY to 9.8% (PLe: 10.8%) due to increase in other expense (VAT payment on Mysore Bellary project), Adj. PAT was down 31% YoY to Rs260m (PLe: Rs382m). SEL is focusing on completing current order book from irrigation segment as it want to concentrate on larger ticket size orders going ahead. SEL believes new EPC projects won in FY16 will drive growth in FY17.The stock is trading at core PE of 16x FY17E earnings. We have cut our earnings by ~20% for FY16 and FY17 to factor in weak execution in current quarter and delay in getting new orders. We continue to believe the healthy and improving outlook across segments augur well for future growth. Limited commitment on the current BOT portfolio and well‐funded balance sheet makes it well‐placed to benefit from improved ordering in the Road sector.\nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "10 Feb,2016 1431hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/s/Sadbhav_Infrastructure_Projects_0945_356.jpg", "description": "Prabhudas Lilladher is bullish on Sadbhav Engg has recommended buy rating on the stock with a target price of Rs 340 in its research report dated February 9, 2016.", "title": "Buy Sadbhav Engg; target of Rs 340: Prabhudas Lilladher  - Moneycontrol.com"},
{"content": "\n\n\n\n\n\n\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Motilal Oswal's research report on  Divis Labs In 3Q, DIVI’s revenue grew 8% YoY (14% miss) to INR8.5b, impacted by holiday season and deferment of revenues to 4QFY16. EBITDA grew 13% YoY (14% miss) to INR3.2b and margin expanded 170bp YoY to 37.7%, led by currency benefits and better product mix. PAT grew 12% YoY to INR2.5b, aided by INR30m forex gain and lower than expected depreciation. DIVI trades at 27x FY16E, 23x FY17E and 18x FY18E (P/E), at par with historical average. Large capex addition and growing contribution of API generics are likely put margins under check. However, strong balance sheet (net cash) and high return ratios (RoE at ~29%) provide valuation cushion. We retain our Neutral stance and estimates. Our target price is INR1,180 (20x FY18E; in line with historical average), implying 11% upside. \nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.\n$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "10 Feb,2016 1409hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/buy2_16-9_356x200_0518_356.jpg", "description": "Motilal Oswal has recommended neutral rating on Divis Labs with a target price of Rs 1180 in its research report dated February 8, 2016.", "title": "Motilal Oswal: neutral on Divis Labs; target of Rs 1180   - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Sharmila Joshi of sharmilajoshi.com told CNBC-TV18, \"Aviation is not a sector that I like too much. As far as aviation as a space is concerned, the sector has outperformed from September-October when little else has moved and which is why we are seeing a lot of cuts and a lot of selling coming in stocks like these because typically, when such a sell-off happens, traders do tend to lighten up.\"\"As far as financials go, they are in support of aviation because even going forward we are not expecting a jump in aviation turbine fuel (ATF) prices. So to that extent, earnings will stay okay but at some point in time, you cannot expect them to sustain the margins they have had because some kind of pass through will have to come going ahead. So for me,  SpiceJet   is just an exit and you should just get into some other sector and then look at market with a slightly longer-term perspective,\" she added.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "10 Feb,2016 1510hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/s/SPICEJET_3935_356.png", "description": "Sharmila Joshi of sharmilajoshi.com suggests selling SpiceJet.", "title": "Exit SpiceJet, says Sharmila Joshi  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Rahul Mohindar of viratechindia.com told CNBC-TV18, \"One can buy  Pidilite Industries  . I agree there that we do see a strong uptrend on the stock. In fact I recommended the stock earlier more towards Rs 545-550 but I still see room on the upside. There would be clear outperformance. The level of Rs 620 is where we are pegging as the near term target, with a stop loss at Rs 570. It is still worth getting into.\"\" Torrent Power   has been outperforming when you analyse the last couple of months. So, if you are looking at the near term, Rs 212 is a reasonable stop loss to be buying it with. We have got targets on the stock in the near term at Rs 238,\" he added.\"Finally we have got a short call on  IndusInd Bank  . This is one of the stronger banks if I could put it from that long term perspective. I am trying to take a short term trade for a small target of Rs 820. One can go short at current level with a stop loss at Rs 865.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "10 Feb,2016 1500hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/buy_sell_2840_356.jpg", "description": "Rahul Mohindar, of viratechindia.com recommends buying Pidilite Industries and advises shorting IndusInd Bank.", "title": "Buy Pidilite Industries; short IndusInd Bank: Rahul Mohindar  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Pankaj Jain of SW Capital told CNBC-TV18, \"If you talk on a fundamental basis,  Housing Development and Infrastructure   (HDIL) comes out with its quarterly results on February 13 and even the last quarter results were pretty steady, not all that strong. One of the better real estate companies operating in the part of India and if we are seeing some bit of green shoots in the commercial space, if that is any reflection, I don’t know where the market will settle around but if we talk about stocks as such, HDIL is one of the better plays at current valuations.\"\"So you can stay with the stock for the next one year, I have deeper stoploss for this stocks and I believe that in the next three-six months, we could see gains of about 20-25 percent from current valuations in HDIL. So as of now, don’t worry about what is happening in the market, let the storm pass by but I think HDIL, at current valuations, is one of the stocks you should stand by,\" he added.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "10 Feb,2016 1515hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/h/hdil_356_5443_356.jpg", "description": "Pankaj Jain of SW Capital is of the view that one may stay invested in Housing Development and Infrastructure (HDIL).", "title": "Hold HDIL, says Pankaj Jain  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}JK Jain, Derivative Analyst at Karvy Stock Broking told CNBC-TV18, \"One can sell  Century Textiles and Industries  . The stock has given a clear cut breakdown somewhere around Rs 490-485 levels. Even if you look at derivative data, we are not seeing any kind of big position that have been built up, there were no long unwinding also working despite the stock had given breakdown. So, we could see a long unwinding pressure in the stock which could push it lower. So, go short in the stock at Rs 465 with a stop loss placed above Rs 480. On the downside immediate target would be Rs 430 and can lead even lower beyond that point.\"\"One can buy  GAIL India  . The stock has seen closure of short positions over the weekend. So, one can take a long position in this stock for targets of Rs 360 with a stop loss placed below Rs 335,\" he said.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "10 Feb,2016 1456hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/buy-sell1_200_0310_356.jpg", "description": "JK Jain, Derivative Analyst at Karvy Stock Broking recommends selling Century Textiles and Industries and advises buying GAIL India.", "title": "Sell Century Textiles, buy GAIL India: JK Jain  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Rahul Shah, Associate VP, Equity Advisory Group at Motilal Oswal told CNBC-TV18, \" Eicher Motors  has done quite well post numbers and we have seen a long position also getting added in the stock. So, I would buy Eicher Motors with a stop loss of Rs 17,800 with a target of Rs 18,500.\"\" Pidilite Industries   is holding around almost at closer to the new highs. Still the stock look quite attractive. So, keep a stop loss of Rs 578 and a target of Rs 615 and go long,\" he said.\" Just Dial   has been consistently showing a negative trend since the last couple of series. So, still there is lot of room for downside from current level as well. So, I would short Just Dial from current level with a stop loss of Rs 520 and target of Rs 460.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "10 Feb,2016 1506hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/s/stocks_16-9_356x200_5006_356.jpg", "description": "Rahul Shah, Associate VP, Equity Advisory Group at Motilal Oswal is of the view that one can buy Eicher Motors and feels that one can short Just Dial.", "title": "Buy Eicher Motors; short Just Dial: Rahul Shah  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Ratnesh Kumar, Market Expert told CNBC-TV18, \"Aviation is so hyper competitive, it is so capital intensive, historically I found it very tough to take fundamentally long term calls on the aviation sector. I am sure there are good airlines around the world which from time to time make money for investors. However, on a generic basis it is a tough sector to make a fundamental call and there are more structural growth story kind of sectors both in terms of business growth and even in terms of profitability and margins. So, I would avoid that segment.\"On Friday,  Jet Airways   ended at Rs 570.85, up Rs 41.40, or 7.82 percent on the BSE.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "06 Feb,2016 1227hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/c/civil_aviation_shutterstock_356x200_5928_356.jpg", "description": "Ratnesh Kumar, Market Expert is of the view that one may avoid aviation space.", "title": "Avoid aviation space, says Ratnesh Kumar  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Jai Bala of Cashthechaos.com told CNBC-TV18, \"I was looking at  Bajaj Finance  , it has had a stellar run. We have probably missed the bus if you haven’t taken position already. However,  Dishman Pharma   along with  Cadila healthcare   still looks very interesting at this point. They have much more upsides coming through and they are presenting a low risk entry opportunity.\"\"If you place a stoploss below the January lows both these stocks Cadila and Dishman are looking interesting and they are looking like they will cross at least Rs 450-500. In my opinion Cadila is a much more better stock as far as risk reward is concerned but both have potential to scale new 52-week highs,\" he added.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "06 Feb,2016 1227hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/p/Pharm_medical_drugs_anti_pharma_356x200_0522_356.jpg", "description": "Jai Bala of Cashthechaos.com is of the view that one may look at Cadila Healthcare and Dishman Pharma.", "title": "Look at Cadila Healthcare, Dishman Pharma: Jai Bala  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Jai Bala of Cashthechaos.com told CNBC-TV18, \" ICICI Bank   and  State Bank of India   together are a problem for the market, that is what is holding back the market. We want both these stocks to pickup and once the banking index were to cross above 15700 it would be because both these stocks have stabilised. Both of them are still in a problem zone. It is looking like it is trying to stabilise but it is not yet picking up but we want that to happen for the overall health of the market.\"He further added, \" Maruti Suzuki   has had a stellar run from 2012. So, it is a very welcome correction. I think the correction is still ongoing. There is still little bit of downside left for the stock. It will come somewhere close to Rs 3300-3400 and stabilise somewhere around there. Then post that it will go to record highs but you have got to be patient for this stock to correct a bit more, don't get impatient and try to pull the trigger here. It has corrected quite a bit but still there is a small bit of downside to be done for the stock in the short term. I think that will be stabilising around Rs 3300-3400.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "06 Feb,2016 1227hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/m/maruti356x200_4526_356.jpg", "description": "Jai Bala of Cashthechaos.com feels that Maruti Suzuki may slip to Rs 3300-3400.", "title": "Maruti Suzuki may slip to Rs 3300-3400, says Jai Bala  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Watch the interview of Sudarshan Sukhani of s2analytics.com, Rajat Bose of rajatkbose.com, Prakash Gaba of prakashgaba.com, Ajay Bodke of Prabhudas Lilladher and Chandan Taparia of Anand Rathi Securities with Latha Venkatesh and Sonia Shenoy on CNBC-TV18, in which they shared their readings and outlook on market technicals, fundamentals and F&O side of the market respectively as well as specific stocks and sectors. $(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "08 Feb,2016 1006hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/s/stocks_16-9_356x200_1734_356.jpg", "description": "Watch the interview of Sudarshan Sukhani of s2analytics.com, Rajat Bose of rajatkbose.com, Prakash Gaba of prakashgaba.com, Ajay Bodke of Prabhudas Lilladher and Chandan Taparia of Anand Rathi Securities with Latha Venkatesh and Sonia Shenoy on CNBC-TV18.", "title": "Here are some top trading tips from experts  - Moneycontrol.com"},
{"content": "\n\n\n\n\n\n\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Ahead of its IPO, which opens on Monday, software provider Quick Heal Technologies has raised Rs 133.9 crore through issue of shares to 10 anchor investors, including BNP Paribas Advantage and Reliance MF. Quick Heal has alloted 41.70 lakh equity shares at Rs 321 apiece, the upper end of the price band, to 10 anchor investors. The anchor investors include foreign investors -- Driehaus Emerging Markets Smallcap Growth Fund, Nomura India Stock Mother Fund, BNP Paribas Advantage and Jupiter India Fund.\r\nBesides, ICICI Prudential MF, Birla Sun Life Insurance, Reliance MF, Sundaram MF, Axis MF and Reliance Life Insurance are among the domestic investors. Quick Heal has fixed the price band at Rs 311-321 for its initial public offer (IPO), which will hit the market on February 8. The IPO, which would close on February 10, involves a fresh issue of equity shares by the company.\r\nBesides, the issue consists of an offer for sale of about 62.70 lakh equity shares by promoters Kailash Sahebrao Katkar and Sanjay Sahebrao Katkar, as well as Sequoia Capital India Investment Holdings III. ICICI Securities, Jefferies India and JPMorgan India are the book running lead managers while Link Intime India is the registrar to the public issue. While the proceeds from the offer of sale would not go to Quick Heal Technologies, the Rs 250 crore funds raised from fresh issue of equity shares would be used by the company for advertising and sales promotion and capital expenditure for research and development.\r\nThe proceeds would also be invested to purchase, develop and renovate its office premises in Kolkata, Pune and New Delhi, as well as general corporate needs. The company is a provider of security software products and solutions in India. Quick Heal's equity shares are proposed to be listed on BSE and NSE. $(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "08 Feb,2016 1044hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/q/quickheal_3854_356.jpg", "description": "Ahead of its IPO, which opens on Monday, software provider Quick Heal Technologies has raised Rs 133.9 crore through issue of shares to 10 anchor investors, including BNP Paribas Advantage and Reliance MF. ", "title": "Quick Heal raises Rs 134 cr from anchor investors  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Sudarshan Sukhani of s2analytics.com told CNBC-TV18, \" Asian Paints   keeps on coming in my list. It is one of my favourites and the market also probably likes it. The stock is now on the verge of a breakout from a recent high; that is good news. So, I would be a buyer in Asian Paints. Expect that the rally that we have seen for the last two days here is likely to continue.\" \" UltraTech Cement  , like other cement companies like  Ambuja Cements   and to some extent  ACC  , has seen a V-shaped rally. Now, V-shaped rally is not very reliable but it is there and we have to expect what we get. After that it has been consolidating for five days and that is a better opportunity to go long. It had a very nice day on Friday and is also on the verge of a breakout on the upside. Cement generally is giving us a mild momentum, the keywords here are mild, short term, so, we are buyers,\" he said.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "08 Feb,2016 0937hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/buy_1_16-9_356x200_0455_356.jpg", "description": "Sudarshan Sukhani of s2analytics.com recommends buying Asian Paints and UltraTech Cement.", "title": "Buy Asian Paints, UltraTech Cement: Sudarshan Sukhani  - Moneycontrol.com"},
{"content": "\n\n\n\n\n\n\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}GoAir now plans to come out with its initial share sale next fiscal amid persisting uncertainty over the scheduled delivery of new Airbus aircraft which is key for the no-frills carrier's ambitious growth strategy. The airline originally was looking to hit the capital market in the current financial year, which has also seen budget carrier IndiGo's blockbuster IPO. Sources said that GoAir is still awaiting clarity on the delivery of 72 Airbus A320 neo planes before taking a final decision on the timing of the IPO.\r\nThe delivery of the aircraft was to start from April this year. While the Wadia group airline has not officially made its IPO plan public, sources said GoAir would be looking to raise around USD 150-175 million. At current exchange rate, this would translate into Rs 1,000 to 1,200 crore.\r\nApart from aircraft delivery schedule, GoAir would also be taking into account market conditions before deciding on the IPO timing, sources said. GoAir's ambitious fleet expansion plans have taken a hit with European aircraft maker Airbus recently indicating a potential delay in the delivery schedule for A320 Neos due to some \"industrial reasons\". The airline was supposed to have 26 Airbus A320 neos by end of 2017.\r\nIn June 2011, it had placed order for 72 new A320 neos, valued at about Rs 32,400 crore on list price, with Airbus. Currently, GoAir has 19 A320s in the fleet operating 144 daily flights across 22 domestic destinations. The IPO would help the carrier raise funds for international operations, which it would start after having a fleet of minimum 20 planes.\r\nUnder existing regulations, domestic carriers can fly overseas only if they have at least five years of operational experience and a minimum of 20 aircraft. Once it comes out with the IPO, GoAir would be the fifth local airline to get listed after  Jet Airways  ,  SpiceJet   and IndiGo. Kingfisher, which was listed, grounded its operations in December 2012.\r\nIn October last year, IndiGo's parent  InterGlobe Aviation   mopped up little over Rs 3,000 crore through its IPO.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "08 Feb,2016 0951hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/g/goair_airline_256_0618_356.jpg", "description": "The airline originally was looking to hit the capital market in the current financial year, which has also seen budget carrier IndiGo's blockbuster IPO. Sources said that GoAir is still awaiting clarity on the delivery of 72 Airbus A320 neo planes before taking a final decision on the timing of the IPO. ", "title": "GoAir IPO likely next fiscal as it awaits clarity on A320 neos  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Prakash Gaba of prakashgaba.com told CNBC-TV18, \"Structurally, when I look at the chart of  Cadila Healthcare   , looks like it is a bottoming out process and it has given first indication at around Rs 320, so if we get a dips under Rs 320 it is a buying opportunity. The stock should be looked at from a slightly longer-term perspective. The first technical target that I have is around Rs 340. I think it is going up there. I would have a stop loss below Rs 391 and trade long in Cadila, looks certainly good to me.\"\" Axis Bank   looks to me more of a short covering upmove. I like the move, it has seen the lows on Thursday somewhere closer to Rs 370. So, if this upmove and momentum continues Axis is climbing to levels closer to Rs 420. Looks like Rs 420 on Axis Bank is looking on cards because private sector bank is looking good. I would have a stop loss below Rs 318 and trade long,\" he said.\"I like  Ajanta Pharma  , upmove is there and looks like it is going up. May be it can climb to levels closer to Rs 1,355, keep stop loss below Rs 1,307.\"\"Looks like  Allahabad Bank   for the banking pack has seen a good upmove today and the target that I have is around Rs 55. I would have a stop loss below Rs 51 and trade long here.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "08 Feb,2016 1045hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/a/Axis_Bank_0217_356.jpg", "description": "Prakash Gaba of prakashgaba.com recommends going long in Cadila Healthcare and Axis Bank and Allahabad Bank.", "title": "Go long in Cadila Health, Axis Bank, Allahabad Bank: Prakash Gaba  - Moneycontrol.com"}]