[[[[[{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}On February 19, 2016 Reliance Mutual Fund Reliance Mid And Small Cap Fund sold 5,74,278 shares of  Everest Industries   at Rs 201.80 on the BSE.However, SBI Mutual Fund bought 5,74,278 shares at Rs 201.80.On Friday, Everest Industries ended at Rs 204.90, up Rs 3.00, or 1.49 percent on the BSE.The share touched its 52-week high Rs 430 and 52-week low Rs 193 on 15 July, 2015 and 12 February, 2016, respectively.The company's trailing 12-month (TTM) EPS was at Rs 21.76 per share. (Dec, 2015). The stock's price-to-earnings (P/E) ratio was 9.42. The latest book value of the company is Rs 207.82 per share. At current value, the price-to-book value of the company was 0.99. The  dividend   yield of the company was 2.44 percent.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-20 09:53:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/e/eveready_356_1445_356.jpg", "description": "On February 19, 2016 Reliance Mutual Fund Reliance Mid And Small Cap Fund sold 5,74,278 shares of Everest Industries at Rs 201.80 on the BSE.", "title": "SBI Mutual Fund buys 5.74 lakh shares of Everest Industries  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Prakash Diwan of prakashdiwan.in told CNBC-TV18, \"I think what is happening is the convergence of a lot of positives for all the aviation players and when you look at utilisation level like 92 percent plus for somebody like  SpiceJet  , of course you need to take it with a pinch of salt because SpiceJet always is prone to giving out the maximum amount of incentives and discounts and offer sales for at least three to four months in the year.\" \"In case the load factor remains the same for a premium airline like  Jet Airways  , you can imagine the kind of realisation that it is sitting on. It is already paired debt, the fuel price has been so beneficial to most of these players and now the routes that Jet Airways is likely to fly along with Etihad tie up are going to be very lucrative. So, all that combines and no wonder the promoters know that this is the time to put money into this company. So, I would definitely pick Jet Airways out of the three listed stocks which are left on the market,\" he said.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-19 16:25:00", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/j/jet_airways_2503_356.jpg", "description": "Prakash Diwan of prakashdiwan.in is of the view that one can pick Jet Airways from the aviation space.", "title": "Pick Jet Airways, says Prakash Diwan  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Amit Harchekar, Chief Technical Strategist at A PLUS Analytics told CNBC-TV18, \"We are positive on markets and that is why we believe a lot of midcap stocks which carry high beta has a potential to rebound by at least 4-5 percent. Within that, we believe  SRF   has found a multiple support of around Rs 1,070-1,080. So, we are expecting a rebound of at least six percent in the near term. So, stop loss for the long trade would be at Rs 1,060 and we are expecting the stock to test around Rs 1,180-1,190 which turns out to be 61 percent retracement of the short term downmove.\"\"On daily chart,  Indiabulls Real Estate   has given a breakout from a falling wedge on the line chart and we believe this indicates that the stock has already formed a short term bottom. Right now we are expecting a bear market rally and Indiabulls Real Estate can extend towards Rs 57 and even Rs 62. So, keeping a stop loss of Rs 45.5, one can go long at current level,\" he added.\"One can buy  Reliance Capital   which is a high beta stock. The stock is trading at a positive divergence on RSA and has managed to sustain above Rs 328 levels. So, keeping a stop loss of Rs 315, one can go long on Reliance Capital for a target of Rs 360-365.\"\"We still remain extremely bearish on PSU Banks and within that  Andhra Bank   is failing to sustain beyond Rs 50-51 levels. So, right now Rs 51 turns out to be the resistance of the falling channel. So, there is high possibility of the stock again not breaching that. So, keeping stop loss on Rs 51, we would recommend going short on Andhra Bank February futures. We are expecting the stock to retest levels of Rs 41-42 in the next couple of trading sessions.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-19 16:25:00", "image_url": "http://www.moneycontrol.com/news_image_files/2016/356x200/b/buy_356x200_5217_356.jpg", "description": "Amit Harchekar, Chief Technical Strategist at A PLUS Analytics recommends buying SRF, Indiabulls Real Estate and Reliance Capital and advises shorting Andhra Bank.", "title": "Buy SRF, Indiabulls Real Estate, Reliance Capital; short Andhra Bank: Amit Harchekar  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Ashish Kyal of wavesstrategy.com told CNBC-TV18, \"Even last week,  Suzlon Energy   has been all over the places. It moved from Rs 9 to Rs 35-36. It then crashed back towards Rs 11, it then moved again towards Rs 28 and now it is again back to Rs 12. So I would suggest staying back with a stock that has been moving in this fashion is absolutely not a good investment. It is better to be moving out of a stock like this with such a high volatility and no clear direction, no clear trend and it has been also moving below its important moving averages.\"He further added, \"It is better to stay out with Suzlon and invest in other largecap companies probably something like  Tata Consultancy Services   (TCS) or something like  Asian Paints  ,  Ashok Leyland  . So any rallies towards the level of Rs 17-18 should be a good exit price and on the downside one can probably use Rs 11 as a very strict stoploss for the existing position.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-19 16:27:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/s/Suzlon_Turbine_Power_1218_356.jpg", "description": "According to Ashish Kyal of wavesstrategy.com, one may sell Suzlon Energy.", "title": "Sell Suzlon Energy, says Ashish Kyal  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Ashish Kyal of wavesstrategy.com told CNBC-TV18, \" Man Industries   has bounced back from Rs 45 and rallied towards Rs 125 till September last year but then it again started crashing down and it is now substantially lower back towards Rs 50 levels. I would suggest to definitely be out of the stock like this. So any pullback from here should be used as an exit opportunity because it doesn’t make sense to be with this stock that has been underperforming for almost eight years now and it is better to invest in something in stocks like probably  Asian Paints  , which has been doing exceptionally good, something like  Ashok Leyland   that has been outperforming the overall sell off that we have seen over the past few days and week.\"\"So I think it is better to be with the largecaps and that too with the outperforming stocks rather than something like this that has been all over the places over past many years,\" he added.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-19 16:30:00", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/s/steel-duty-356_3003_356.jpg", "description": "Ashish Kyal of wavesstrategy.com is of the view that one may exit Man Industries on rallies.", "title": "Exit Man Industries on rallies, says Ashish Kyal  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Sudarshan Sukhani of s2analytics.com told CNBC-TV18, \" United Spirits   has come down to a strong support level. If you are an investor, you could do well to buy it and hold it in your portfolio. It is one of the better FMCG stocks.\"United Spirits closed at Rs 2,405.40, up Rs 138.00, or 6.09 percent. It has touched an intraday high of Rs 2,450.00 and an intraday low of Rs 2,271.00.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-19 16:30:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/u/United_Spirits365_5632_356.jpg", "description": "Sudarshan Sukhani of s2analytics.com recommends buying United Spirits for long term.", "title": "Buy United Spirits for long term: Sudarshan Sukhani  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Axis Securities's research report on  ONGC ONGC’s Q3FY16 adjusted PAT was in line with our estimate of Rs 39 bn. However, reported PAT atRs 12.6 bn was lower due to asset impairment of Rs 39.4 bn undertaken during the quarter on East Indian onshore assets due to sharp decline in crude oil prices.We are expecting (a) substantial reduction in cess rates and (b) reintroduction of 5% customs duty in the budget, which will support ONGC’s earnings, valuations given weak global commodity prices. ARs 2,000/te reduction in cess would improve ONGC’s earnings by ~Rs4/share, while 5% customs duty would improve FY17 EPS by ~Rs1.5/share. We maintain HOLD on ONGC with a fair value of 220.\nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-18 12:39:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/o/ONGC1_356_1153_356.jpg", "description": "Axis Securities has recommended hold rating on ONGC  with a target price of Rs 220 in its research report dated February 12, 2016.", "title": "Hold ONGC; target of Rs 220: Axis Securities  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Gaurang Shah of Geojit BNP Paribas told CNBC-TV18, \"I would say hold on to  Hindustan Petroleum Corporation   (HPCL). There is a lot of to and fro as far as the output is concerned from OPEC whether to maintain a January level or not. Iran on the flip side has had a hard stand. They are not willing to budge as far as the output is concerned. In fact they wanted to increase their output from 5 lakh barrels per day to maybe 8-8.5 lakh barrels per day.\"\"As a disclosure, we do have a positive coverage on HPCL and  BPCL  . From a long-term point of view, our target stands at about Rs 1,000-1,050 on HPCL and our guess is that after this initial boil that you are seeing on the crude oil, once the dust settles down and the noise subsidies you could possibly see oil again heading lower which is the best case scenario for oil marketing companies,\" he added.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-19 16:23:00", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/p/petrol_4705_356.jpg", "description": "Gaurang Shah of Geojit BNP Paribas feels that Hindustan Petroleum Corporation may test Rs 1050.", "title": "HPCL may move to Rs 1050: Gaurang Shah  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Watch the interview of Ashwani Gujral of ashwanigujral.com & Manish Hathiramani of Deen Dayal Investments with Nigel D'Souza & Sonia Shenoy on CNBC-TV18, in which they shared their readings and outlook on specific stocks. $(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-19 13:27:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/m/Market-Free-fall_16-9_356x200_2330_356.jpg", "description": "Watch the interview of Ashwani Gujral of ashwanigujral.com & Manish Hathiramani of Deen Dayal Investments with Nigel D'Souza & Sonia Shenoy on CNBC-TV18, in which they shared their readings and outlook on specific stocks.", "title": "Here are Ashwani Gujral & Manish Hathiramani's top trading picks  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Rushil Decor reported revenue gain of 18 percent to Rs 74.7 crores year-on-year in its third quarter and the company's stock rallied 40 percent this week.\r\nIn an interview with CNBC-TV18, Krupesh Thakkar, MD of Rushil said that the company has 'captured' the market in South India but at present there are no plans for further capital expenditure.Watch video for more. $(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-19 16:04:00", "image_url": "http://www.moneycontrol.com/news_image_files/2016/356x200/b/Budget2016_India_GDP_Growth_inflation_rise_down_economy_Sensex_up_bse_nse_stock_markets_dalal_street_356x200_1808_356.jpg", "description": "In an interview with CNBC-TV18, Krupesh Thakkar, MD of Rushil said that the company has 'captured' the market in South India but at present there are no plans for further capital expenditure.", "title": "Rushil Decor surges 40% in one week: What's buzzing?  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Moneycontrol BureauShares of  Astec Lifesciences   rose more than 5 percent intraday Thursday on completion of stake sale in its subsidiary company.The company has sold 100 percent of the total paid-up equity share capital held in its subsidiary Astec Crop Care (ACCPL) to Ashok Hiremath and Varun Hiremath. Post the completion of the sale, ACCPL has ceased to be a subsidiary of the company. The company has recorded net loss of Rs 17 crore in the third quarter ended December 2015 against profit of Rs 3.59 crore in year ago period.At 13:34 hrs Astec Lifesciences was quoting at Rs 190.40, up Rs 5, or 2.70 percent on the BSE.Posted by Rakesh Patil$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-18 13:57:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/s/sun_pharma_3121_356.jpg", "description": "Shares of Astec Lifesciences rose more than 5 percent intraday Thursday on completion of stake sale in its subsidiary company.", "title": "Astec Life up 5% on completion of 100% stake sale in subsidiary  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Sudarshan Sukhani of s2analytics.com told CNBC-TV18, \"One may buy  Infosys   and  Zee Entertainment  .\"He further added, \"One may sell  BPCL  .\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-18 15:10:00", "image_url": "http://www.moneycontrol.com/news_image_files/2016/356x200/b/BUY_356X200_0947_356.jpg", "description": "Sudarshan Sukhani of s2analytics.com is of the view that one may buy Infosys.", "title": "Buy Infosys; sell BPCL: Sudarshan Sukhani  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Here are a few top buzzing midcap stocks picked by CNBC-TV18's analysts in trade today. We have  Max India  ,  ABG Shipyard  ,  Strides Shasun  ,  JSPL  ,  Glenmark  ,  DRL  ,  Quick Heal  , and  Just Dial  .Watch videos for more$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-18 14:01:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/n/Nifty-Stocks_16-9_356x200_5118_356.jpg", "description": "Here are a few top buzzing midcap stocks picked by CNBC-TV18's analysts in trade today. We have Max India, ABG Shipyard, Strides Shasun, JSPL, Glenmark, DRL, Quick Heal, and Just Dial.", "title": "Top buzzing midcap stocks to trade on February 18  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Watch the interview of Ashwani Gujral of ashwanigujral.com and Chandan Taparia of Anand Rathi Securities with Mangalam Maloo and Reema Tendulkar on CNBC-TV18, in which they shared their readings and outlook on market and specific stocks. $(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-18 14:16:00", "image_url": "http://www.moneycontrol.com/news_image_files/2016/356x200/b/Budget_2016_budget_Stocks_markets_bse_NSe_Sensex_stockmarkets_traders_356x200_1704_356.jpg", "description": "Watch the interview of Ashwani Gujral of ashwanigujral.com and Chandan Taparia of Anand Rathi Securities with Mangalam Maloo and Reema Tendulkar on CNBC-TV18, in which they shared their readings and outlook on market and specific stocks.", "title": "Here are few stock trading ideas from experts  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Ashwani Gujral of ashwanigujral.com told CNBC-TV18, \"One may sell  Maruti Suzuki   with a stoploss at Rs 3660 and target of Rs 3580.\"\"One may sell  Cipla   with a stoploss at Rs 526 and target of Rs 505.\"\"One may buy  ICICI Bank   with a stoploss at Rs 192 and target of Rs 206.\"\"One may buy  Hero Motocorp   with a stoploss at Rs 2580 and target of Rs 2700.\"\"One may buy  Pidilite Industries   with a stoploss at Rs 610 and target of Rs 635.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-18 15:10:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/buy-sell_190_0400_356.jpg", "description": "Ashwani Gujral of ashwanigujral.com is of the view that one may buy ICICI Bank and sell Cipla.", "title": "Buy ICICI Bank; sell Cipla: Ashwani Gujral  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Ashish Kyal of wavesstrategy.com told CNBC-TV18, \"If the horizon is one year, then one should hold  Larsen and Toubro   (L&T). It has corrected sharply from the levels of Rs 1,850 to these low of around Rs 1,000. Over the past few days, we have seen some kind of bounce back activity, which is happening and the stock has now arrived again towards the 50-days moving average.\"\"It is going to be very crucial for it to cross above Rs 1,200, which is the resistance zone. So, if it manages to cross above Rs 1,200 then we can see the levels of Rs 1,350 or Rs 1,400 on upside. So, one can hold this stock from a year's perspective, but one has to apply a stoploss which should be near Rs 950. If this stock crosses or closes below Rs 950, I am not sure where it is headed. So, use Rs 950 as a very strict stoploss and there can be some reversal or buying activity which might be emerging in this stock after a long time,\" he added.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-19 16:27:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/l/Larsen_L", "description": "Ashish Kyal of wavesstrategy.com is of the view that one may stay invested in Larsen and Toubro.", "title": "Stay invested in L&T, says Ashish Kyal  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Ashwani Gujral of ashwanigujral.com told CNBC-TV18, \" Infosys   is a buy with a stop loss of Rs 1,100 for target of Rs 1,165. It is a strong stock, almost at fresh highs.\"\" Marico   is also a strong stock. So, the is a buy with a stop loss of Rs 226 for target of Rs 242,\" he said.\" PFC   is a sell with a stop loss of Rs 151 for target of Rs 138.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-18 15:08:00", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/f/fund_manager_with_buy_sell_long_short_356X200_4349_356.jpg", "description": "Ashwani Gujral of ashwanigujral.com recommends buying Infosys and Marico and advises selling PFC.", "title": "Buy Infosys, Marico; sell PFC: Ashwani Gujral  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Deepak Shenoy of capitalmind.in told CNBC-TV18, \"We believe that  Amara Raja Batteries   has come off the lows and it is showing a small breakout at this point from a technical perspective, the fundamentals have been good. Both their input prices are down and margins are up, there are about 30 percent increase in profits. We believe that the profit story remains for a lot of players in that space but right now the fundamentals seem to matter less to the market than somehow funds flow and FIIs and so on.\"\"We are taking a small starting position in it. We believe that this stock could cross Rs 930-940 and then move on further. We are looking at it from an outlier perspective in terms of moving up at this point. Strict stop losses are advised. Fundamentals don’t necessarily work in a market where there is so much fund flow situations going on but we like the stock,\" he said.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-19 13:48:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/a/Amara_raja3651_5108_356.jpg", "description": "Deepak Shenoy of capitalmind.in likes Amara Raja Batteries for a target of Rs 930-940.", "title": "Like Amara Raja Batteries, target Rs 930-940: Deepak Shenoy  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Watch the interview of Hemen Kapadia of KRChoksey Securities & Sharmila Joshi of Sharmilajoshi.com who shared their readings and outlook on specific stocks and sector. Hemen Kapadia of KRChoksey SecuritiesPipavav DefenceAs of now  Pipavav Defence   would be a hold. I wouldn’t have a five year view simply because I have data of five years. In this five years it has moved between Rs 30 on the downside Rs 120 on the upside without any directional bias, so honestly speaking we have gone nowhere. As of now it is oversold. A bounce seems to be on the anvil, so I would suggest a hold with a stoploss of Rs 52. Sharmila Joshi of sharmilajoshi.comBerger PaintsWe have seen  Berger Paints   at Rs 215-220 levels for the longest time and we saw it make that break in November-December when it went to Rs 270-280 kind of level. The logic is pretty much clear, it is because crude is in this kind of trajectory though it is sort of stabilised last couple of weeks, so I do expect it to go lower and stay in this range. So given that the profit margins for Berger Paints or any of the paint companies will remain good but the trick lies in the topline because we are not seeing any demand pick up. If you were in a situation where crude prices were lower and you saw demand pick up then paint companies would be the space to be in, but I still think that if you want a play which takes advantage of lower crude prices then paints is one sector. So one should stay put especially if one has a year's outlook.Pipavav Defence  Pipavav Defence   move from Rs 30 to Rs 120, Rs 120 was when euphoria must be high as that you will see big orders coming to Indian companies. Now because of the way markets are and because of the fact that we haven’t seen too much of that getting translated into real orders be little cautious because there is nothing else in the fundamentals to suggests why the stocks should even be at Rs 64. Let see what the Budget says, let us see in the next three-four months if anything of that happens in the mean time if you see a bit of a bounce in midcap space and you get an exit price use it. Unless of course some material development as happened in the mean time. So, I would sell but for a five year view maybe one can stay put because there was stock of defence orders and we really haven’t seen that happening.HCC We have seen this entire sector beaten down and if you are talking of like a two year view may be things can happen in these two years. You can see infra companies do better. My advice will be to switch from  Hindustan Construction Company   (HCC) because it make a lot more sense to switch to a company where earnings are already decent and they are not so leveraged. You can look at an  IRB Infra   or  Sadbhav Engineering  . We have heard a lot of road orders being awarded and both these companies are within that space. So, it might be a slightly safer bet within the infra space. However, as space it is beaten down, so just consider switching to another stock in the infra space if you want to remain there.Strides Shasun There is no getting away from the fact that pharmaceutical as a space has become quite volatile given the fact that we are seeing a lot more action from USFDA and lot more inspections and comments etc.  Strides Shasun   again has been volatile and the results have been good this quarter. They seem to be acquiring companies apart from of course the Shasun bid that they acquired. So, overall Strides is on a strong wicket and if one is patient then he/she will definitely get to see high levels from here. However, what we must bear in mind is that possibly next year – year and a half it would be a little volatile for pharmaceutical stocks. So, if one is willing to ride that out then I would suggest that one stays put.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-18 15:52:00", "image_url": "http://www.moneycontrol.com/news_image_files/2016/356x200/h/Hold_buy_sell_budget_2016_356x200_4818_356.jpg", "description": "Watch the interview of Hemen Kapadia of KRChoksey Securities & Sharmila Joshi of Sharmilajoshi.com who shared their readings and outlook on specific stocks and sector.", "title": "Your stocks: Investment ideas by market experts  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Chandan Taparia of Anand Rathi Securities told CNBC-TV18, \"We are recommending to go long on  Siemens  . We have seen strong recovery in the last trading session with open interest addition. Multiple times, it has taken support near to Rs 975 zone. Yesterday it comfortably traded above Rs 1,000 levels and given momentum. Today, the stock is trading in a range but the way it is holding the gains, we are expecting it to head to higher levels. So, we are recommending to buy with a stop loss of Rs 995 for target of Rs 1,080-1,090 kind of levels.\"\"We are witnessing sustained selling in most of the private and the PSU bank but  IndusInd Bank   is the only stock which is holding the gains. Just a couple of days back it made a narrow range formation and after that narrow range formation, the stock is holding the gains with sustained buying interest. Although open interest is around 5-6 percent but if it aids open interest of more than 10 percent this momentum may head to higher levels. So, recommending to go long on IndusInd Bank as we believe that this stock has potential to outperform the market and if Nifty manages to hold. So, recommending to buy on small decline with a stop loss of Rs 820 for the target of Rs 868,\" he said.\" HCL Tech   is the only counter from the IT space which is holding the strength. Just a couple of days back it made low near to Rs 786 and after that it is continuously making higher lows from last four or five trading sessions. Although it is trading below its 50-day moving average but the way it is sustaining above its 13-day moving average and also holding above its hurdle of Rs 830, it has potential to move on higher side. Recommending to buy the stock with a stop loss of Rs 818 for target of Rs 870-875.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-18 15:08:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/buy_1_16-9_356x200_0455_356.jpg", "description": "Chandan Taparia of Anand Rathi Securities recommends buying Siemens, IndusInd Bank and HCL Tech.", "title": "Buy Siemens, IndusInd Bank, HCL Tech: Chandan Taparia  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Here are a few top buzzing midcap stocks picked by CNBC-TV18's analysts in trade today. We have  SBI  ,  Den Networks  ,  Punj Lloyd  ,  Kesoram Industries  ,  Valecha Engineering  ,  Opto Circuits  , and  PNB  .Watch videos for more$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-16 13:31:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/m/mkt_5653_356.jpg", "description": "Here are a few top buzzing midcap stocks picked by CNBC-TV18's analysts in trade today. We have SBI, Den Networks, Punj Lloyd, Kesoram Industries, Valecha Engineering, Opto Circuits, and PNB.", "title": "Top buzzing midcap stocks to trade on February 16  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Rahul Mohindar of viratechindia.com told CNBC-TV18, \"One can buy  Axis Bank   with a target of Rs 430 and a stop loss at Rs 397.\"\"One can also buy  Tata Consultancy Services   with a target of Rs 2,350 keeping a stop loss at Rs 2,230,\" he said.Ashwani Gujral of ashwanigujral.com recommends selling  Motherson Sumi Systems   with a target of Rs 215 and a stop loss at Rs 230 and  Power Finance Corporation   with a target of Rs 135 keeping a stop loss at Rs 149.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-16 16:00:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/m/mkt1_2347_356.jpg", "description": "Rahul Mohindar of viratechindia.com recommends buying Axis Bank and Tata Consultancy Services.", "title": "Buy Axis Bank, Tata Consultancy Services: Rahul Mohindar  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Ashwani Gujral of ashwanigujral.com told CNBC-TV18, \" HDIL   is clearly collapsing, so that is a sell with a stop loss of about Rs 62 and we should look for targets now closer to Rs 54. Basically, with this kind of momentum everything that went up 6-8 percent and real estate index was the third best performer up about 7 percent, so all those gains will get taken away. So, any real estate stock which is in the F&O, I think should do fairly badly.\"\"Interestingly  SKS Microfinance   hasn't fallen a whole lot. It has infact outperformed. Now all of these outperformers are coming under pressure. SKS Micro is a sell with a stop loss of Rs 501 with a target of Rs 480,\" he said.\" Union Bank   will also give up all of its gains from yesterday. So, that is a sell with a stop loss of Rs 116 with target of Rs 104.\"\"Everything is going down.However F&O stocks have their own issues with short positions etc. I think  Jet Airways   can go towards Rs 430-440 where it had significant tops earlier on. So, support is at lower levels around Rs 430-440 but as we have seen people got skewed with  BPCL  ,  HPCL   and aviation that now when these stocks are going to come down they will also come down in a heap.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-16 16:18:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/s/Sell_16-9_356x200_0717_356.jpg", "description": "Ashwani Gujral of ashwanigujral.com recommends selling HDIL, SKS Microfinance and Union Bank.", "title": "Sell HDIL, SKS Microfinance, Union Bank: Ashwani Gujral  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Parag Thakkar of HDFC Securities told CNBC-TV18, \"From a longer term perspective, so many stocks might look good at these levels because valuations are very compelling but  Larsen and Toubro   (L&T) as we all know has its own issue. One is size, on a Rs 80,000 crore topline to grow at 15 percent is very difficult in this kind of scenario. When capex cycle is down globally, you have no capex in oil and gas, even on the India side only roads and power transmission seems to be firing otherwise other segments are down.\"\"They have that asset ownership business, BOT business where something like Hyderabad Metro is there where they have to fund it. There will be a huge leverage taken. So, those kind of issues remain in L&T. All said and done, from a longer term perspective, it is a best proxy play for infrastructure in India. So, definitely at these valuations, one can look to buy on dips very gradually and that is my advice for most of the largecap beaten down stocks,\" he said. \"One interesting thing in this market is that all very large businesses have become very small market cap companies; that is very interesting.  Tata Motors   with a topline of Rs 2,75,000 crore and EBITDA of Rs 40,000 crore is trading at EV of around Rs 1,30,000 crore. So, those are very interesting opportunities.So, those kind of buying opportunities one should gradually buy because you never know, gradually on every dip one should accumulate.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-16 16:25:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/l/Larsen_4724_356.jpg", "description": "Parag Thakkar of HDFC Securities is of the view that one can accumulate L&T on dips and feels that Tata Motors looks interesting.", "title": "Accumulate L&T on dips, Tata Motors looks interesting: Parag Thakkar  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Ashwani Gujral of ashwanigujral.com told CNBC-TV18, \"One can look at financials where one can sell  Union Bank   with a stop loss at Rs 115 for a target of Rs 104. One can also sell  Engineers India   with a target of Rs 142 and a stop loss at Rs 155.\"\"One can however buy  Cairn India   keeping a medium term view.  State Bank of India   may test Rs 140 while  Tata Motors   may hit Rs 250. Bajaj Finance may see sell off hapenning while  Ashok Leyland   may test Rs 75,\" he said.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-16 17:10:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/s/stocks_16-9_356x200_0445_356.jpg", "description": "Ashwani Gujral of ashwanigujral.com is of the view that one can sell Union Bank and Engineers India while one can buy Cairn India.", "title": "Sell Union Bank, Engineers India; buy Cairn India: Ashwani Gujral  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Manas Jaiswal of manasjaiswal.com told CNBC-TV18, \"One can buy  Kotak Mahindra Bank   with a target of Rs 654 and a stop loss at Rs 622.\"\"One can also buy  Hero Motocorp   with a target of Rs 2700 keeping a stop loss at Rs 2565,\" he said.Ashwani Gujral of ashwanigujral.com told CNBC-TV18, \"One can buy  Britannia Industries   with a target of Rs 2820 keeping a stop loss at Rs 2700.\"\"One can also buy  Infosys   with a target of Rs 1165 and a stop loss of Rs 1100,\" he added.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-18 15:55:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/Buy_16-9_356x200_4914_356.jpg", "description": "Manas Jaiswal of manasjaiswal.com recommends buying Kotak Mahindra Bank with a target of Rs 654 and Hero Motocorp with a target of Rs 2700.", "title": "Stocks you can buy today & sell tomorrow  - Moneycontrol.com"},
{"content": "\n\n\n\n\n\n\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Software provider Quickheal Technologies, which raised Rs 451 crore through its initial public offer (IPO), will list shares on the stock exchanges on Thursday.\r\nThe equity shares will be listed on the NSE as well as on the BSE.\r\nThe IPO, which closed on February 10 was oversubscribed 11 times at a price band of Rs 311-321 per share.\r\nThe IPO consisted of fresh issue of Rs 250 crore and an offer for sale of about 62.70 lakh equity shares by promoters Kailash Sahebrao Katkar and Sanjay Sahebrao Katkar, as well as Sequoia Capital India Investment Holdings III.\r\nThe portion set aside for qualified institutional buyers (QIBs) was subscribed 4.34 times, while retail investors saw 3.8 times subscription.\r\nMeanwhile, non-institutional investors category was subscribed a whopping 36.7 times.\r\nQuick Heal had raised Rs 133.9 crore through issue of shares to 10 anchor investors.\r\nICICI Securities, Jefferies India and JPMorgan India were the book running lead managers while Link Intime India was the registrar to the public issue.\r\nWhile the proceeds from the offer of sale would not go to Quick Heal Technologies, the Rs 250-crore funds raised from fresh issue of equity shares would be used by the company for advertising and sales promotion and capital expenditure for research and development.\r\nThe proceeds would also be invested to purchase, develop and renovate its office premises in Kolkata, Pune and New Delhi, as well as for general corporate needs.\r\nThe company is a provider of software security products and solutions in India. $(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-17 07:58:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/q/quickheal_3854_356.jpg", "description": "Software provider Quickheal\r\nTechnologies, which raised Rs 451 crore through its initial\r\npublic offer (IPO), will list shares on the stock exchanges on\r\nThursday.", "title": "Quickheal to list shares on Feb 18  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Mayuresh Joshi of Angel Broking told CNBC-TV18, \"Clearly the doubt still persists in terms of how the energy and crude prices are moving at this point of time and execution again has been a sort of a deterrent for the  Larsen and Toubro   (L&T) from a medium-term perspective. However, having said that, the order book is quite robust, close to Rs 2,56,000 crore odd. So, that gives decent revenue visibility. You are talking about the networking capital cycle actually getting peaked off around 24-25 percent mark.\"\"I think the negatives that the stock carries along with the entire sector is the kind of order flows that one really expects to be very tepid over the next few quarters, execution again is going to be extremely key. Clearly, if you are talking about a slowdown happening, the hydrocarbons business might have some amount of issues but it has been strongly resilient over the last few quarters,\" he said.\"So, what L&T has apart from its standalone engineering and hydrocarbons division is its IT business as well. So, any listing there off over the next few quarters, what it does with its real estate arm, the SOTP valuation also taking into account, the finance arm that L&T has got in terms of  L&T Finance Holdings  , clearly I think you are talking about a company which is in the right scheme of things for the Indian economy.\" \"We are not seeing the right moves in terms of the credit cycle and that is why the tepidness probably in a lot of these stocks, it might for all eventuality along with the markets correct another 10-12 percent from the current level but in my opinion that gives a better entry point for the investor. You should have a longer time horizon of a year, year and a half to say the least.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-16 15:25:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/l/Larsen_4724_356.jpg", "description": "Mayuresh Joshi of Angel Broking is of the view that one may prefer Larsen and Toubro for long term.", "title": "Prefer L&T for long term: Mayuresh Joshi  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}SP Tulsian of sptulsian.com told CNBC-TV18, \" Gujarat Pipavav Port   and  Adani Ports   have bottomed out. Adani Ports was ruling at around Rs 280-300 and it fell to Rs 180.. So, if you go by their Q3 numbers, I do not think that there has been severe drop in the volumes because people have been very apprehensive, tapering exports of the country, lower coal handling by the port, because they are more specialised in the coal handling and all that. Those fears are not seen from the Q3 numbers.\"\"With a view of about one year, I am positive on the stock, I will not be surprised to see a price of Rs 240-250 in the next three months and in 2016, it can be an outperformer,\" he said.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-16 16:20:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/a/adani.bmp_2944_356.jpg", "description": "SP Tulsian of sptulsian.com has a positive view on Adani Ports with a target of Rs 240-250 in next three months.", "title": "Positive on Adani Ports, target Rs 240-250 in next 3 months: SP Tulsian  - Moneycontrol.com"},
{"content": "\n\n\n\n\n\n\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Here are stocks that are in news today: Bank Of India S&P revises Bank Of India outlook to negative from stable; affirms rating Tata Motors  ,  Bharat Forge   (BS)Cos along with General Dynamics tie up for USD 11mn defence bidBid is to make combat infantry vehicles for the Indian Army  Indian Overseas Bank S&P places IOB on 'CreditWatch' with negative implication as losses mount Ashok Leyland   (ToI)Co takes JV partner Renault-Nissan to courtCo accuses JV partner Nissan of taking steps against terms of partnership Kesoram Ind Board Approves Issuance Of Equity Shrs Up To Rs 90 Cr To Promoter Manav Invst To Issue Shares To Promoter Manav Invst On Preferential BasisTo Issue Optionally Convertible Pref Shares Up To Rs 90 Cr To IndusInd Bank Inox Leisure Co Says Delhi High Court Approves Merger Of Satyam Cineplexes With CoOther stocks and sectors in the news Valecha Engg   bags orders worth Rs 398 cr in Chhattisgarh & Mumbai BPCL   gets environment nod for Rs 337 cr pipeline project in Kerala Adani Ports   raises Rs 750 cr by allotment of NCDs On pvt placement basis$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-17 10:30:00", "image_url": "http://www.moneycontrol.com/news_image_files/2013/356x200/l/leerok_stocks_16-9_356x200_2247_356.jpg", "description": "Bank Of India | Tata Motors | Bharat Forge | Indian Overseas Bank | Ashok Leyland | Kesoram Industries | Valecha Engg | Inox Leisure | BPCL and Adani Ports are stocks, which are in news today.", "title": "Stocks in news: Bank Of India, Valecha Engg, BPCL, IOB  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}SP Tulsian of sptulsian.com told CNBC-TV18, \"I will go with three stocks, first  Lupin  , second  Glenmark Pharma   and third is  Wockhardt  . People may find little dilemma in case of Wockhardt but having seen this correction I don't think that you have much downside. Lupin we all know posted good Q3 numbers while Glenmark Pharma's business model is intact.\"\"In fact in Q3 and recent US FDA you have not seen anything coming negative for the stock and inspite of that we have seen the stock having corrected. So, these are the three reasons for buying these stocks,\" he said.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-18 17:06:00", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/p/pharma-1_3554_356.jpg", "description": "SP Tulsian of sptulsian.com recommends buying Lupin, Glenmark Pharma and Wockhardt.", "title": "Buy Lupin, Glenmark Pharma, Wockhardt: SP Tulsian  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Sharmila Joshi of sharmilajoshi.com told CNBC-TV18, \" Pipavav Defence   move from Rs 30 to Rs 120, Rs 120 was when euphoria must be high as that you will see big orders coming to Indian companies. Now because of the way markets are and because of the fact that we haven’t seen too much of that getting translated into real orders be little cautious because there is nothing else in the fundamentals to suggests why the stocks should even be at Rs 64.\"\"Let see what the Budget says, let us see in the next three-four months if anything of that happens in the mean time if you see a bit of a bounce in midcap space and you get an exit price use it. Unless of course some material development as happened in the mean time. So, I would sell but for a five year view maybe one can stay put because there was stock of defence orders and we really haven’t seen that happening,\" she added.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-18 15:53:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/p/pipavav_356_4732_356.jpg", "description": "According to Sharmila Joshi of sharmilajoshi.com, one may hold Pipavav Defence with a long term view.", "title": "Hold Pipavav Defence with long term view: Sharmila Joshi  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;} Quick Heal Technologies   listed at a 5 percent fall in opening on Thursday at Rs 305, but bounced back immediately with 3 percent gains on NSE. The stock ended 20 percent down at the closing on Thursday.  The company raised Rs 451 crore through its initial public offer (IPO) last week, which consisted of fresh issue of Rs 250 crore and an offer for sale of about 62.70 lakh equity shares by promoters Kailash Sahebrao Katkar and Sanjay Sahebrao Katkar, as well as investor Sequoia Capital India Investment Holdings III.Kailash Katkar, MD & CEO of the company says that Quick Heal is in process of developing a number of enterprise security products and the funds raised will be utilized for further development and marketing of the products.  The company has received Rs 56 crore tax demand from the Income Tax department for certain products. The demand, Katkar says is baseless as the products are manufactured in excise-free regions.The company has not done any provisioning for the same, he adds. Going forward, Katkar expects improvement in margins. Below is the transcript of Kailash Katkar’s interview with CNBC-TV18's Anuj Singhal, Reema Tendulkar and Sonia Shenoy.Anuj: Before we talk about the complain issue the first thing I want to know from you is why do you go for Initial Public Offering (IPO) in the first place. Because out of Rs 450 crore the fresh issue was Rs 250 crore. But you already had cash in hand of about Rs 100 crore and even the forthcoming cash flow was likely to be good. So, what was the need for the IPO in the first place?A: I understand your question. Going for IPO and having a primary in company was for new product development and taking that product to the market. So, Quick Heal Technologies is definitely known by anti-virus company in a big way but we have already started developing lot of enterprise security products and we wanted to take these products to all customers. We have also created a separate brand for this enterprise security products by name Seqrite and we wanted to take this product to the market and we wanted to increase the R&D for developing more enterprise products and other Mobile Device Management (MDM) products.Sonia: The bigger issue that the market is a bit worried about is the fact that SEBI has sent a notice to investors about a service tax of Rs 56 crore that you have to pay and additional penalty of another Rs 56 crore along with interest. Is this correct, is this amount something that the company has to pay out?A: I will say this that the company has received the order from service tax department but if I have to answer your question directly put it in a brief way that when this product came under excise in year 2006 from that day we are paying excise on Quick Heal range of products. When we thought of when this product as an excise product we took this manufacturing part of it to excise free zone that is Rudrapur and Himachal Pradesh and the day when we shifted our manufacturing process to the excise free zone now the department wants service tax on that product. But from my point of view this is fundamentally not right. I believe in Indian legal justice and I wanted to take this to next level and I am 100 percent sure the case is very strong.Sonia: But even if you contest it, if suppose you have to go ahead and make that service tax payment instead of the Value Added Tax (VAT) payment that you used to make earlier then what could the impact be on your net profits margin because the service tax that you will have to pay will be 14 percent?A: Yes, today it is at 14 percent. At that given time it was not at 14 percent, it was less but I am 100 percent sure that I will be able to click this. Because the case is very strong. I have taken an opinion advice from a big lawyer from across India, not from one lawyer but I have taken it from multiple expert people.Sonia: So, are you trying to say that Mr Manohar Malani was not allotted 20,000 shares of Quick Heal Technologies in the year 2000?A: Not at all. You can come to my office and check all the books.Sonia: How do you want to respond to that because even if you are saying that these arguments are baseless it does not send a good signal out to the market and to other investors?A: I understand your question but let me tell you one thing I didn’t receive any information from investor about the cheque details and his deposit details.Reema: Have you made any provision up until now of this Rs 56 crore of the tax demand which has been made on the company because while filing the red herring prospectus (RHP) you did have a show cause notice? So, in the financial up until now has any provision being made and will you be making it while this case is under litigation?A: We have not made any provision for this service tax and the auditors have also accepted the fact that the product doesn’t come under service tax.Reema: The demand also talks about an interest component, a service tax demand of Rs 56 crore additional penalty of Rs 56 plus interest. Could you quantify what that interest amount is for us?A: That cannot be determined because I haven’t gone through the interest part of it. I will have to sit and understand that part of it. When I knew that it is not, even auditors are supporting me, my consultants are supporting me and I haven’t met any provision for that.Sonia: You haven’t given us any numbers. The stock is down almost 18 percent just tell us do you expect your margins to be under further pressure because margins have come down from 50 percent couple of years back to 30 percent any more margin pressure that you are expecting?A: No. We are a product company and in product the margins are always high. One thing here is the business is seasonal business. Every quarter is going to perform in a different way. Usually all product companies performs in that way only.Yes, profits have come down because we have invested that amount in to development of a new product which delivers to our customer also. There are additional products which are in developing stage. These margins will be maintained in fact it will go up in coming future.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-19 08:06:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/q/quickheal_3854_356.jpg", "description": "Kailash Katkar, MD & CEO of the company says that Quick Heal is in process of developing a number of enterprise security products and the funds raised will be utilized for further development and marketing of the products. ", "title": "Funds raised will be used for new security products: Quick Heal   - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Prabhudas Lilladher's research report on  Britannia We are cutting BRIT’s FY16‐18 EPS estimates by 1.5‐5.4% due to tepid demand and higher tax rate. BRIT continues to grow ahead of the market led by innovations and distribution gains in rural India and Hindi heartland. The company is operating at all‐time high profit margins led by double‐digit volume growth, cost efficiencies and Premiumisation; however, expansion of incremental margin looks difficult. BRIT is looking at 2.5‐3% price increase as sugar prices are up 38% and Wheat 7% from the lows. We estimate 17.5% PAT CAGR over FY16‐18 post 52% PAT growth in FY16. Retain ‘BUY’, given 52% ROE and ROCE and 40%  dividend   payout.\nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-12 16:55:00", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/b/britanniaa_356200_5315_356.jpg", "description": "Prabhudas Lilladher is bullish on Britannia has recommended buy rating on the stock with a target price of Rs 3200 in its research report dated February 11, 2016.", "title": "Buy Britannia; target of Rs 3200: Prabhudas Lilladher  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Sharmila Joshi of sharmilajoshi.com told CNBC-TV18, \"There is no getting away from the fact that pharmaceutical as a space has become quite volatile given the fact that we are seeing a lot more action from USFDA and lot more inspections and comments etc.  Strides Shasun   again has been volatile and the results have been good this quarter.\"She further added, \"They seem to be acquiring companies apart from of course the Shasun bid that they acquired. So, overall Strides is on a strong wicket and if one is patient then he/she will definitely get to see high levels from here. However, what we must bear in mind is that possibly next year – year and a half it would be a little volatile for pharmaceutical stocks. So, if one is willing to ride that out then I would suggest that one stays put.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-18 15:55:00", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/p/Pharm_medical_drugs_anti_pharma_356x200_0522_356.jpg", "description": "According to Sharmila Joshi of sharmilajoshi.com, one may hold Strides Shasun.", "title": "Hold Strides Shasun, says Sharmila Joshi  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Sharmila Joshi of sharmilajoshi.com told CNBC-TV18, \"We have seen this entire sector beaten down and if you are talking of like a two year view may be things can happen in these two years. You can see infra companies do better. My advice will be to switch from  Hindustan Construction Company   (HCC) because it make a lot more sense to switch to a company where earnings are already decent and they are not so leveraged.\"\"You can look at an  IRB Infra   or  Sadbhav Engineering  . We have heard a lot of road orders being awarded and both these companies are within that space. So, it might be a slightly safer bet within the infra space. However, as space it is beaten down, so just consider switching to another stock in the infra space if you want to remain there,\" she added.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-18 15:54:00", "image_url": "http://www.moneycontrol.com/news_image_files/2016/356x200/i/Infra_Budget_2016_jaitley_FM_356x200_2321_356.jpg", "description": "According to Sharmila Joshi of sharmilajoshi.com, one may exit Hindustan Construction Company and prefer IRB Infrastructure or Sadbhav Engineering.", "title": "Exit HCC; prefer IRB Infra: Sharmila Joshi  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Ashwani Gujral, Fund Manager at ashwanigujral.com told CNBC-TV18, \"The IT index is looking fairly weak and  Mindtree   often has trouble around Rs 1,500. So this is a sell with a stop loss of Rs 1,450 for target of Rs 1,375.\"\" NTPC   is showing lots of strength. Public sector undertakings (PSU) and energy in general are doing that. So that is a buy with a stop of Rs 126 with target of Rs 138,\" he added.\" Ceat   has broken out of some sort of a Rs 50-70 point range. That is a buy with a stop of Rs 975 with target of Rs 1,010.\"\" Idea Cellular   seems to have made some sort of important low around Rs 98-100. So maybe it is a preferred stock but overall these telecom stocks haven’t participated in this pullback and hence they appear more range bound than anything else. Now going into the Budget, you should focus more on policy sensitive stocks, PSUs and defence stocks, those kinds of images. I don’t think just random stocks are likely to do too much.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-16 12:50:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/buy-sell_190_0400_356.jpg", "description": "Ashwani Gujral, Fund Manager at ashwanigujral.com recommends selling Mindtree and advises buying NTPC and Ceat.", "title": "Sell Mindtree; buy NTPC, Ceat: Ashwani Gujral  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}CNBC-TV18s Varinder Bansal lists some of the key stocks which were buzzing in trade today.\nWatch video for more... $(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-18 16:35:00", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/v/varinder_356_30dec_2601_356.jpg", "description": "CNBC-TV18s Varinder Bansal lists some of the key stocks which were buzzing in trade today.", "title": "Stocks that were buzzing in trade today  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Sharmila Joshi of sharmilajoshi.com told CNBC-TV18, \"We have seen  Berger Paints   at Rs 215-220 levels for the longest time and we saw it make that break in November-December when it went to Rs 270-280 kind of level. The logic is pretty much clear, it is because crude is in this kind of trajectory though it is sort of stabilised last couple of weeks, so I do expect it to go lower and stay in this range. So given that the profit margins for Berger Paints or any of the paint companies will remain good but the trick lies in the topline because we are not seeing any demand pick up.\"\"If you were in a situation where crude prices were lower and you saw demand pick up then paint companies would be the space to be in, but I still think that if you want a play which takes advantage of lower crude prices then paints is one sector. So one should stay put especially if one has a year's outlook,\" she added.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-18 15:25:00", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/b/Berger_Paints_India_5403_356.jpg", "description": "Sharmila Joshi of sharmilajoshi.com is of the view that one may hold Berger Paints.", "title": "Hold Berger Paints, says Sharmila Joshi  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}SP Tulsian of sptulsian.com told CNBC-TV18, \"If market is really pulled up, by may be IT stocks or may be pharma or automobiles are the real sectors that will give confidence. I have been keeping positive stance on  Infosys   and  Tata Consultancy Services   and may be to some extent on  Mindtree   considering Q3 numbers.\"Tata Consultancy Services closed at Rs 2,315.30, up Rs 37.30, or 1.64 percent. It has touched an intraday high of Rs 2,319.45 and an intraday low of Rs 2,279.00.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-18 16:21:00", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/s/software-driven--356_0225_356.jpg", "description": "SP Tulsian of sptulsian.com has a positive view on Infosys, Tata Consultancy Services and Mindtree.", "title": "Positive on Infosys, TCS, Mindtree: SP Tulsian  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Hemen Kapadia of KRChoksey Securities told CNBC-TV18, \"As of now  Pipavav Defence   would be a hold. I wouldn’t have a five year view simply because I have data of five years. In this five years it has moved between Rs 30 on the downside Rs 120 on the upside without any directional bias, so honestly speaking we have gone nowhere. As of now it is oversold.\"\"A bounce seems to be on the anvil, so I would suggest a hold with a stoploss of Rs 52,\" he added.At 15:11 hrs Pipavav Defence and Offshore Engineering Company was quoting at Rs 64.95, down Rs 0.10, or 0.15 percent on the BSE.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-18 15:16:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/p/pipavav_356_4732_356.jpg", "description": "Hemen Kapadia of KRChoksey Securities is of the view that one may stay invested in Pipavav Defence.", "title": "Stay invested in Pipavav Defence: Hemen Kapadia  - Moneycontrol.com"},
{"content": "\n\n\n\n\n\n\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}EIS's research report on  UPL UPL posted flat revenue in Q3FY16, mainly on account of adverse currency impact of -13%. Volume growth stood at healthy rate of 11%. Geographically North America and Latin America contributed highest to growth with 12% & 14% respectively. India/EU/RoW region declined by 17%/9%/8%.UPL’s Q3FY15 revenue were in line with our estimates. UPL is a leading global generic player in the agrochemical Industry (ranks among the Top-5 post patent agrochemical manufacturers in the world). We expect UPL sales to register CAGR of 10% over FY2015-17E, with EBITDA margins expansion, driven by operating leverage, to 19.5%. Adj PAT is likely to show a CAGR of 22% during over mentioned period. Over past 4 quarters, UPL has seen strong revival in volume growth, with improving EBITDA margin. With RoCE/RoE of 23%/20% in FY16 & FY17, at current valuation of 14x & 12x expected earnings of FY16 and FY17 respectively, stock of the company offers upside of 20% from here on, hence we rate stock Accumulate with TP of Rs524.\nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-12 17:07:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/u/UPL-logo_0450_356.jpg", "description": "EIS is bullish on UPL has recommended buy rating on the stock with a target price of Rs 524 in its research report dated January 29, 2016.", "title": "Buy UPL; target of Rs 524: EIS  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Firstcall research report on  Solar industries India ltd  Solar Industries India Ltd (SIIL) founded in 1995, is one of the largest comprehensive explosives & initiating devices manufacturing company in India.The company’s Net Sales rose by 20.31% y-o-y of Rs.3848.21 million for the 3rd quarter of the FY16 as against Rs. 3198.49 million for the prior period of Lastyear.In Q3 FY16, Net profit of the company registered a growth of 16.40% y-o-y to Rs. 411.69 million from Rs.353.68 million in Q3 FY15. Earning before Interest, Tax and Dep was at Rs. 788.54 million for the 3rd quarter of FY16 as against Rs.611.05 million in the corresponding quarter of the previous year. Profit before tax (PBT) at Rs. 661.90 million in Q3 FY16 compared to Rs. 467.35 million in Q3 FY15,registered a growth of 41.63%. EPS of the company stood at Rs. 22.75 in December quarter against Rs. 19.54 in the corresponding quarter of the previous year. In Q3 FY15, Export & Overseas Turnover registered a growth of 64.38% y-o-y of Rs. 1264.40 million as compared to 769.20 million in Q3 FY14. For nine months end of FY16, company registered a growth of 15.09% in Net sales to Rs. 11074.76 million from Rs. 9622.59 million for nine months end of FY15. Net Profit for the 9m ended of FY16 was at Rs. 1179.18 million, growth of 9.89% compared with Rs. 1073.03 million for the 9m ended of FY15.Net Sales and PAT of the company are expected to grow at a CAGR of 11% and 14% over 2014 to 2017E.The company’s domestic market has registered a strong demand indicating growth in coal mining activities. As also most of its overseas subsidiaries reflected strong growth despite of challenges from mining slowdown. The Government has set an excavation target of 1.35 billion tones of Coal by FY202, to meet the increased demand. The company decided to start bulk operations in South Africa, acquired Land & likely to commence construction work in Feb 16, this year and operation from in next financial year. Hence We recommend ‘BUY’ in this particular scrip with a target price of Rs.3600.00 for Medium to Long terminvestment. \nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.\r\n $(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-12 17:09:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/Buy_16-9_356x200_4914_356.jpg", "description": "First call research is bullish on Solar Industries India Ltd and has recommended buy rating on the stock with a target price of Rs 3600 in its research report dated feburary 10, 2016.", "title": "Buy Solar industries;target of Rs 3600: First call research  - Moneycontrol.com"},
{"content": "\n\n\n\n\n\n\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}EIS's research report on  Bayer CropScience Bayer CropScience (BCS) posted a decline of 9% in Sales to Rs6,222 mn and 10% in total revenue to Rs 6,424 bn during Q3FY16. This compares poorly to 5% decline in Q2FY16. Growth was impacted on account of poor monsoon across the country.BCS posted disappointing performance for Q3FY16 on back of drought condition at country level. We have cut down our earning estimates by 31% & 30% to reflect the same and buyback impact. We expect BCS to post CAGR of 5% in Sales & 10% decline in PAT over FY15-17E. At Target P/E of 25x and adding surplus cash, we arrive at target price of Rs 2,302 which indicates for a huge downside of 34% from current levels. Hence we recommend Sell on stock. \nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.\n$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-12 17:07:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/Bayer_Crop365_2818_356.jpg", "description": "EIS is bearish on Bayer CropScience has recommended Sell rating on the stock with a target price of Rs 2302 in its research report dated February 3, 2016.", "title": "Sell Bayer CropScience; target of Rs 2302: EIS  - Moneycontrol.com"},
{"content": "\n\n\n\n\n\n\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}EIS's research report on  Talwalkar Other income for the quarter increased by 10x on back of strong cash on balance sheet, while interest cost increased by 18% for the quarter. Overall PAT (before MI) for the quarter registered a growth of 17% to Rs 69mn. Net PAT post Minority Interest grew by 21% to Rs 54mn.TBVF has been focusing on converting itself from being pure gym company to a fitness company. Over FY2015-17, we expect company to post CAGR of 19%, 20% & 13% in Sales, Profit & EPS respectively. At current valuation of 10x FY2017E EPS and 4.4x FY2017 EV/EBITDA stock is trading at attractive valuation. Hence we recommend Buy rating on the stock with Target Price of Rs 317. \nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-12 17:10:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/t/talwalkars_16_9_3720_356.jpg", "description": "EIS is bullish on Talwalkar has recommended buy rating on the stock with a target price of Rs 317 in its research report dated February 9, 2016.", "title": "Buy Talwalkar; target of Rs 317: EIS  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Emkay's research report on  Dish TV Consolidated revenue was at Rs7.7bn (+2.5% qoq), EBITDA stood at Rs2.7bn (+4.1% qoq) with EBITDA margin at 34.4% (+52bps qoq). Net profit was at Rs685mn vs Rs870mn in Q2FY16, impacted by higher depreciation and lower other income Weak KPI’s: ARPU was at Rs172 vs Rs171 in Q2FY16, lower than expected. Net adds at 0.32mn vs 0.34mn in Q2FY16 was a disappointment. Lower subscriber addition led to healthy FCF of Rs1296mn vs Rs849mn in Q2FY16. Debt pre-payment of Rs3bn came as a lone positive. Management target further debt reduction of Rs1.5bn in 4Q Management expects subscriber addition to jump in Q4FY16. ARPU to remain suppressed due to Zing and recent launch of Rs99/p.m. package. We estimate ARPU of Rs176 (+2.2%) for FY17E, ARPU growth may get restricted if service tax increases further Weak subscriber addition compared to competitors and suppressed ARPU was key negative. Cut target multiple to 10x EV/EBITDA (last 3 year average) with revised PT of Rs100. Sharp stock price correction limits downside, however, consistent improvement in KPI’s to drive re-rating Dish TV disappointed with substantially lower net adds and weaker than expected ARPU, however, debt pre-payment of Rs3bn was positive. Subscriber addition to rebound while ARPU to remain suppressed due to launch of low end package. Healthy FCF and further deleveraging is the key for stock re-rating. Key risks to our call: 1) license fee ruling against DTH operators, 2) significant down trading within the packages due to aggressive price increase, 3) rise in competitive intensity, and 4) INR depreciation. We have not factored impact of lower license fee based on TRAI recommendations in our estimates as it is yet to be approved by government. \nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-12 17:12:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/d/Dish_TV365_1207_356.jpg", "description": "\r\nEmkay is bullish on Dish TV has recommended buy rating on the stock with a target price of Rs 100 in its research report dated February 3, 2016.\r\n", "title": "Buy Dish TV ; target of Rs 100: Emkay  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Emkay's research report on  Cummins Cummins Q3FY16 operational performance was marginally below our expectations (a) 5.9% YoY increase in revenues and (b) 260bps YoY decline in EBITDAM. Domestic segment grew by 14% YoY while exports decline by 6% YoY Revenue guidance for FY16E maintained - (i) Domestic segment to grow at 10-15% and (ii) Exports to grow at 0-5%. Buy with a price target of Rs1,074/Share. We continue to like Cummins given its (1) technology and distribution intensive business model (2) strong cash generation and (3) quality of business and its managers. Cummins has relatively strong balance sheet and return ratios (+30%) – amongst the best in the capital goods universe. We retain positive bias with Buy rating & maintain our price target of Rs1,074/Share \nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-12 17:11:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/c/Cummins_0301_356.jpg", "description": "Emkay is bullish on Cummins has recommended buy rating on the stock with a target price of Rs 1024 in its research report dated February 3, 2016.", "title": "Buy Cummins; target of Rs 1024: Emkay  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Emkay's research report on  Guj State Petro Operationally in-line result, however beat came at PAT level on account of higher other income, which is attributable to ~Rs0.17bn of  dividend   income from Gujarat Gas. Revenue and EBITDA came in line with our est. Revenue came in at Rs2.5bn (our est. Rs2.5bn) and EBITDA came in at Rs2.1bn (our est. Rs2.1bn) Transmission tariff remained flat sequentially at Rs1.07/scm. However, transmission volume increased by 3.1% qoq from 24.3mmscmd to 25.1mmscmd Other expenditure increased from Rs0.17bn to Rs0.3bn due to 1) and fluctuation in SUG cost and 2) in Q2FY16 Company has reported lower other expenditure which was adjusted in Q3FY16. Interest cost declined during the quarter by 13.5% to Rs0.2bn on repayment of debt We expect multiple triggers for GSPL, i.e. 1) sharp correction in spot LNG price - Currently ~$5/mmbtu, 2) upward revision in tariff and 3) expected improvement in volumes from stranded power plants Essar and OPAL. We maintain our Buy reco. with target price of Rs163. Stock currently trades at 11.3x FY17E EPS and 1.6x FY17 P/B\nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-12 17:13:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/buy3_16-9_356x200_0652_356.jpg", "description": "Emkay is bullish on Guj State Petro has recommended buy rating on the stock with a target price of Rs 163 in its research report dated February 4, 2016.", "title": "Buy Guj State Petro; target of Rs 163: Emkay  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Emkay's research report on  Tata Comm Consolidated revenue at Rs51bn (+3.8% yoy) and EBITDA at Rs7.6bn (-5.1% yoy) with EBITDA margin of 14.9% (-140bps yoy). PAT was Rs219mn vs Rs1085mn in Q3FY15 and Rs60mn in Q2FY16. PAT was impacted by lower other income and higher depreciation Global voice solution: Worst EBITDA performance in more than 4 years. Revenue was Rs19.8bn (-5.5% yoy and -4.2% qoq) and EBITDA was Rs862n (-50% yoy and -49.7% qoq) with EBITDA margin of 4.3% (-390bps yoy and -400bps qoq) Global data solution: Improved performance as stated by the management in H1FY16. Revenue at Rs27bn (+17% yoy and +4% qoq) and EBITDA at Rs5.9bn (+21% yoy and +18% qoq) with EBITDA margin of 22% (+70bps yoy and +250bps qoq) Continued pressure on voice performance to impact cash generation, resulting to delay in de-leveraging. Investments in new services to drive data revenue growth in long term to continue. Maintain ACCUMULATE with revised PT of Rs450 Continued weakness in voice remains a concerns as it is the cash machine for the company, given low capex spends. Weakness in voice and continued investment in data segment to drive growth will keep the balance sheet leveraged. We expect voice business to see continued pressure while Data segment is expected to remain on healthy footing. Retain ACCUMULATE with revised PT of Rs450. \nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-12 17:13:00", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/t/Tata_Comm_4225_356.jpg", "description": "Emkay is bullish on Tata Comm has recommended buy rating on the stock with a target price of Rs 450 in its research report dated February 4, 2016.", "title": "Buy Tata Comm; target of Rs 450: Emkay  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}GEOJIT BNP PARIBAS reserach report on  Exide Industries Exide Industries (EIL) is a leader in storage battery business with a market share of 60% in India. Its segment includes automotive and industrial lead acid batteries. EIL’s Q3FY16 sales de-grew by 2.2% on a YoY basis which is below our estimates. PAT grew 38% YoY to Rs134Cr.Revenue was subdued due to reduction in inverter volumes by -27% and -7% for Automotive and Industrial. EBITDA margins improved by 380bps YoY to 15.4% due to reduction in lead prices and cost reduction efforts. Replacement volume increased by 5% & 10% YoY for 4W and 2W.The industrial segments (36% of revenue) remain subdued. The prospects depend on economic recovery.Going forward we expect rise in market share from unorganised sector which is currently about 40% through implementation of GST. We revise downward our Revenue and PAT estimate for FY17E by -9% and -11% respectively. We expect the worst has come in the price and maintain our rating at accumulate with a target price of Rs144.valuations: EIL at CMP is currently trading at P/E of 18.2x and 16.2x on FY16E and FY17E earnings respectively. Using SOTP methodology we value the standalone business at 16x over FY17E EPS which is at a discount of 12.5% to its historical average of 18x. Insurance business which is valued at book value of Rs19 per share has been performing well in the south India and it is now expanding well to northern India. We revised our estimates and maintain Accumulate rating with a target price ofand -11% respectively. We expect the worst has come in the price and maintain our rating at accumulate with a target price of Rs144.\nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.\r\n $(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-12 17:12:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/Buy_16-9_356x200_4914_356.jpg", "description": "GEOJIT BNP PARIBAS  is bullish on Exide Industries and has recommended buy rating on the stock with a target price of Rs 144 in its research report dated Feburary 10, 2016", "title": "Buy Exide Industries Ltd; target of Rs144: GEOJIT BNP PARIBAS  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Emkay's research report on  HSIL Healthy quarter – Revenues up 9.5% at Rs 5.1bn, EBITDA grew 1.1% yoy to Rs 954mn, EBITDA margin at 18.8% down 160bps yoy and APAT at Rs 370mn, up 22% yoy Building products grew by 17.3% aided by consumer product and healthy uptick in faucets; Retail segment seeing steady growth however industrial bleeding. Packaging products reports steady revenue despite a high base EBITDA margins decline 160bps yoy to 18.8% impacted due to unfavorable mix. Lower fuel cost benefit channelized on Ad spend and distribution spends in consumer appliances Cut FY17 earnings by 4% factoring lower margins due to spends in consumer appliances segment. Penetration of faucets and consumer appliances are revenue drivers. Retain BUY with revised price target of Rs 370/share\nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-12 17:12:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/h/HSIL_3056_356.jpg", "description": "Emkay is bullish on HSIL has recommended buy rating on the stock with a target price of Rs 370 in its research report dated February 3, 2016.\r\n", "title": "Buy HSIL; target of Rs 370: Emkay  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}KRChoksey's research report on  Granules India Net sales for the quarter grew by a moderate 8% YoY to INR 3,449mn below our estimates. Auctus Pharma contributed around INR 300mn to sales with a small profit of INR 2mn at PBT level. EBIDTA grew by a healthy 24% YoY to INR 677mn & EBITDA margins stood at 19.6% expanding by 260bps mainly due to operational efficiency in base business and superior product mix. PAT grew by 15% YoY to INR 272mn on account of a higher tax rate at 33%. The Board of directors declared third interim  dividend   of 15p/share.Granules India has achieved a whopping 28% CAGR in revenues & 36% CAGR in earnings over the past 10 years. We expect a healthy earnings momentum to kick-start on account of Granules moving up the value chain towards high margin business, improved capacity utilization & additional product offerings from Auctus Pharma. We expect revenue and earnings CAGR of around 17% and 28% respectively over FY15-18E. Currently the stock is trading at 15x of FY17E & 12x of FY18E EPS. We upgrade our rating to ‘BUY’ from ‘ACCUMULATE’ with the target price of INR 160 at 17xFY18E.\nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-10 17:45:00", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/g/granules_1749_356.jpg", "description": "KRChoksey is bullish on Granules India has recommended buy rating on the stock with a target price of Rs 160 in its research report dated January 29, 2016.\r\n", "title": "Buy Granules India; target of Rs 160: KRChoksey  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Karvy's research report on  Kwality Kwality started its procurement from it’s MCCs in 2008 and currently set up 24 MCCs in northern states of Punjab, Rajasthan, UP & Haryana near its milk processing facilities in Haryana & UP. For procurement of quality milk, the company plans to open another 30 MCCs in next 2 years to ensure uninterrupted supply of milk and to reach the target of procuring milk from its own MCCs at 50% in next 3 years. Kwality is one of the leading dairy players and is on investment mode to strengthen its backward and forward integration. The company has changed its business model towards sale of more branded products and towards retail segment. Value added products are likely to support margins for the company going forward. Stock is currently trading at 8.9x FY17E EPS and we initiate coverage on Kwality with a “BUY” recommendation, we value the company at 10.5x and arrive at target price of Rs.135 for holding period of 9-12 months, with an upside of 18%. \nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-10 17:49:00", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/k/Kwality_356x200_5149_356.jpg", "description": "Karvy is bullish on Kwality has recommended buy rating on the stock with a target price of Rs 284 in its research report dated January 29, 2016.", "title": "Buy Kwality; target of Rs 135: Karvy  - Moneycontrol.com"},
{"content": "\n\n\n\n\n\n\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Prabhudas Lilladher's research report on  Ramco Cements The Ramco Cements (TRCL) reported Q3FY16 earnings way ahead of our expectation on the back of beat across the fronts. Demand in the region continued to remain sluggish due to subdued demand across sectors and delay in recovery expected on account of formation of new states. We expect recovery to kickstart in couple of quarters on the back of enhanced focus of state governments on infra spending, stabilisation of newly formed states, new capital development in Amaravati and revival in small scale housing demand sponsored under various state government schemes. In this backdrop, we like TRCL as the best play on recovery in the South underpinned by highly competitive operations. We reiterate “BUY” with TP of Rs490 (earlier TP: Rs447), an EV/EBITDA of 12xFY17.We revise upward our EBITDA estimate for FY16/FY17 by 11%/7% on the back of steep cut in costs. EPS estimate is revised upward by 12%/7% at Rs19.3/Rs23.7 helped by lower interest cost (due to lower interest rate) and higher EBITDA. \nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-10 17:49:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/buy3_16-9_356x200_0652_356.jpg", "description": "Prabhudas Lilladher is bullish on Ramco Cements has recommended buy rating on the stock with a target price of Rs 490 in its research report dated Februrary 9, 2016.", "title": "Buy Ramco Cements; target of Rs 490: Prabhudas Lilladher  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}ICICIDirect's research report on  Arvind Arvind’s Q3FY16 results were in line with our expectations. Consolidated revenues grew 4% YoY to | 2158 crore (I-direct estimate: | 2172 crore). Absence of real estate revenues in the current quarter moderated the earnings momentum Brand & retail continued its growth momentum with growth of 12% YoY to | 737 crore. Revenues from ‘Power’ brands grew 15% YoY to | 415 crore. The growth was moderated by intentional ramp down in its Mega mart business, which de-grew 24% YoY to | 136 crore Textile business remained flattish in the quarter at | 1290 crore. Majority of the textile business was driven by growth in garments, which grew 8% to | 201 crore. Denim volumes were hit by a price hike coupled with a change in the product mix. Wovens and voiles grew 4.8% and 12% respectively. EBITDA for the quarter de-grew 2.3% YoY to | 281 crore (I-direct estimate: | 277 crore). Following this, margins sequentially declined 80 bps QoQ (up 60 bps YoY) to 13.1%. Higher traded goods coupled with increase in employee expenses impacted margins Benefit from lower interest expense was completely offset by higher depreciation and tax expense. Subsequently, PAT de-grew 5% YoY (up 13.5% QoQ) to | 103 crore (I-direct estimate | 102 crore) Following the expansion in Ethiopia, the company would double its shirt manufacturing capacity. Increased contribution from garmenting to standalone revenues would perk up higher margins. The dual advantage of manufacturing and retail presence makes Arvind the most preferred “Make & Distribute in India” partner for its associated brands. We continue to maintain our growth estimates for Arvind. We maintain BUY recommendation with a target price of | 370. \nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.\n$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-09 17:31:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/a/Arvind3651_5053_356.jpg", "description": "ICICIDirect is bullish on Arvind and has recommended buy rating on the stock with a target price of Rs 370 in its research report dated February 9, 2016.", "title": "Buy Arvind; target of Rs 370: ICICIDirect  - Moneycontrol.com"},
{"content": "\n\n\n\n\n\n\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Religare's research report on  Lupin LPC’s Q3FY16 revenue/PAT at Rs 35.6bn/Rs 5.3bn were above our estimates and broadly in line with consensus. However, margins at 24.7% surprised positively led by one-time compensation income of Rs 500mn-600mn and strong contribution from gFortamet. In terms of geographies, the US business grew 21.6% (or US$ 34mn) and Japan 16% QoQ. We tweak estimates to factor in reduced tax rates (as per management guidance) and roll over to a Mar’17 TP of Rs 1,800 (from Rs 1,720). Maintain HOLD.We raise our FY16/FY17/FY18 earnings by 1/6%/2% to factor in higher other operating income and a lower tax rate for FY17/FY18. Rolling over to 25x FY18 EPS, we maintain HOLD on the stock with a Mar’17 TP of Rs 1,800 (Sep’16 TP of Rs 1,720 earlier).\nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-09 17:28:00", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/l/Lupin_356_4013_356.jpg", "description": "Religare has recommended hold rating on Lupin Tech with a target price of Rs 1800 in its research report dated February 6, 2016.", "title": "Hold Lupin; target of Rs 1800: Religare  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Rajat Bose of rajatkbose.com told CNBC-TV18, \" Asian Paints   is my old favourite. If at all there were to be any kind of an upswing, Asian Paints could be one and I am waiting for it to actually test Rs 908 once again. So, Rs 908 remains a target and Rs 873 is the stop loss. If there were to be any recovery in the market, Asian Paints could be the one that would lead the rally.\" \"Unless  Jet Airways   falls below Rs 550 kind of levels it is unlikely to show much weakness now and it could actually spring a surprise and move up. The upside target would be Rs 626 to about Rs 639 because Jet is a momentum play. When it gets going it can actually move up pretty sharp. So, put a stop loss below Rs 554 and trade long,\" he said.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-10 09:39:00", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/j/jet_airways_2503_356.jpg", "description": "Rajat Bose of rajatkbose.com recommends going long in Jet Airways and feels that Asian Paints may test Rs 908.", "title": "Go long in Jet Airways, Asian Paints may test Rs 908: Rajat Bose  - Moneycontrol.com"},
{"content": "\n\n\n\n\n\n\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Prabhudas Lilladhar Research report on  Larsen \r\nL&T reported consolidated PAT of Rs10.4bn for Q3FY16 in line with our estimates,led by lower interest cost and higher other income. However, the operating performance was weak as challenges continued to persist in E&C segment both on execution and profitability front. Increased order inflow for the quarter was a surprise (up 11% YoY to Rs385bn). L&T is expecting order flow to be flat YoY in FY16 against previous guidance of 5‐7% growth. L&T maintained its sales guidance at 10‐15% growth for FY16. It highlighted that domestic ordering continues to be dominated by public spending and Private sector capex is yet to pick up. Middle East continues to witness tendering activity for basic infrastructure even in the face of oil price drop. Working capital remained stable at 23.6% of sales in Q3FY16 (V/s 24% sales in Q2FY16). We have cut our earnings estimate by ~10% for FY16 & FY17 to factor in weak margin and revised out TP downward to Rs 1407 (Previous Rs1721). We Maintain ‘BUY’, given the potential the company has once the turnaround sets in.For all recommendations,  click here Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-10 11:20:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/l/Larsen_turbo16-9_356x200_2758_356.jpg", "description": "Larsen & Toubro is bullish on Prabhudas Lilladhar and has recommended buy rating on the stock with a target price of Rs Rs 1,407 in its research report dated January 29, 2016.\r\n", "title": "Buy Larsen & Toubro; target of Rs 1,407: Prabhudas Lilladhar  - Moneycontrol.com"},
{"content": "\n\n\n\n\n\n\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}The initial public offer (IPO) of software provider Quick Heal Technologies has been oversubscribed 1.81 times till afternoon on the last day of the offer today.\r\nThe Rs 451-crore IPO received bids for 1.83 crore shares against the total issue size of over 1 crore shares, data available with the NSE till 1300 hrs showed.\r\nQuick Heal has already raised Rs 133.9 crore through issue of shares to 10 anchor investors.\r\nThe company has fixed the price band at Rs 311-321 for its IPO.\r\nThe IPO, which would close today, consists of fresh issue of Rs 250 crore and an offer for sale of about 62.70 lakh equity shares by promoters Kailash Sahebrao Katkar and Sanjay Sahebrao Katkar, as well as Sequoia Capital India Investment Holdings III.\r\nICICI Securities, Jefferies India and JPMorgan India are the book running lead managers while Link Intime India is the registrar to the public issue.\r\nWhile the proceeds from the offer of sale would not go to Quick Heal Technologies, the Rs 250-crore funds raised from fresh issue of equity shares would be used by the company for advertising and sales promotion and capital expenditure for research and development.\r\nThe proceeds would also be invested to purchase, develop and renovate its office premises in Kolkata, Pune and New Delhi, as well as general corporate needs.\r\nThe company is a provider of security software products and solutions in India.\r\nQuick Heal's equity shares are proposed to be listed on BSE and NSE. $(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-11 07:57:00", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/i/ipo1_1932_356.jpg", "description": "The Rs 451-crore IPO received bids for 1.83 crore shares against the total issue size of over 1 crore shares, data available with the NSE till 1300 hrs showed.", "title": "Quick Heal IPO oversubscribed  - Moneycontrol.com"},
{"content": "\n\n\n\n\n\n\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Prabhudas Lilladher's research report on  GlaxoSmith Con We are increasing FY16 and FY17 EPS estimates by 2.4‐5.7% factoring in benefits of price increase and Novartis’ OTC business. GSK continues to gain share in MFD segment due to stronghold of Horlicks and Boost. However, 11% price increase in the past six months and likely entry of ‘Patanjali’ remains a concern. Although SMP prices are down 18% YoY and remain benign, gradually increasing barley, sugar and wheat prices will cap further increase in gross margins, in our view. We expect GSK to sustain leadership led by strong brands, innovations and rising distribution reach; expect 12% PAT CAGR over FY16‐18 due to peak margins in FY16. We remain positive given that GSK has 1) Valuations (28.2xDec17EPS) at a discount to coverage universe 2) strong leadership in MFD segment 3) 22% PAT CAGR in past 10 years and 4) likely upside from Novartis OTC business. Retain Buy\nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-10 16:39:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/d/dollar_buying_356_0527_356.jpg", "description": "Prabhudas Lilladher is bullish on GlaxoSmith Con has recommended buy rating on the stock with a target price of Rs 6940 in its research report dated Februrary 9, 2016.", "title": "Buy GlaxoSmith Con; target of Rs 6940: Prabhudas Lilladher  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Motilal Oswal's research report on  Berger Paints The company has not reported consolidated earnings for the first time, reportedly due to confusion in the company on SEBI's guidelines. Standalone earnings are above estimates aided by continued gross margin gains. Revenue growth was restricted to 10% while the company has not cut prices since March 2015 when prices were adjusted by 2.2%. Berger, along with Asian Paints, continues to gain market-share in the industry that has seen healthy growth last quarter on account of concentration of festive season into this quarter. Usually, the festive and the post monsoon painting season is spread over 2Q and 3Q. Standalone EBITDA margins 300bps to 29% as gross margins have improved sharply. RM cost has decline 380bps YoY This has helped the company post a 38% growth in reported standalone profits. EXPRESS PAINTING - The painting service from Berger Paints is witnessing good demand and as the company trains more painters the service is expected to expand. Service cost to consumers is at par with industry unlike Asian Paints. However, paints being sold through this channel are of premium range. Berger Nippon JV - JV will address 4W (cars & UVs) and 3W and this JV will open up a new business stream. Berger will bring its relationships while Nippon will bring the technology. We have rolled over or TP to FY18 earnings and now expect INR. 325 (40xFY18E EPS) in the next 12-18 months.\nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-10 12:02:00", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/b/Berger_Paints_India_5403_356.jpg", "description": "Motilal Oswal is bullish on Berger Paints has recommended buy rating on the stock with a target price of Rs 325 in its research report dated February 9, 2016.", "title": "Buy Berger Paints; target of Rs 325: Motilal Oswal  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Prabhudas Lilladher's research report on  Jubilant Life Jubilant’s net sales declined by 5% YoY to Rs13.4bn while EBITDA grew by Rs3.1bn in Q3FY16. The company’s overall financial performance except LSI sales were in line with our estimates as Jubilant has been benefitting from ramp up in CMO, volume growth in US generics (through new launches), price rise in Specialty intermediates and better realisations in Nutritional products. LSI revenues were impacted due to lower price of pyridines (due to pass on benefits of lower price of crude oil derivatives) and lower demand of pyridines and life science chemicals (LSC) from global agro‐chemical customers. The Pharma division sales grew by 4% YoY, while LSI’s business declined by 12% as lower solvent prices (derivatives of Crude oil) drove down both input prices as well as end products. Overall, Jubilant maintained sequential EBITDA margin of Pharma at 30% while it reduced by 100bps to 15.5% in LSI in Q3FY16. With growing utilisation of CMO plants and flexibility in PPES business, we expect Jubilant’s sales growth to get further boost in FY17E and FY18E. The full benefit of CMO, however, will be realised in 2‐3 years as guided by management. Lower crude and ethanol prices to maintain 15‐16% LSI margin in FY16E‐18E with Pharma to maintain EBITDA margin at 30% on higher Radiopharma sales. We maintain ‘BUY’ and retain TP at Rs578. \nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-10 16:39:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/j/Jubilant_Life365_3021_356.jpg", "description": "Prabhudas Lilladher is bullish on Jubilant Life has recommended buy rating on the stock with a target price of Rs 578 in its research report dated Februrary 9, 2016.\r\n", "title": "Buy Jubilant Life; target of Rs 578: Prabhudas Lilladher  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Aditya Agarwal of Way2Wealth Securities told CNBC-TV18, \" HDFC   has given a negative break on crucial support of Rs 1,190-1,200 levels last month and thereafter it consolidated in that range, but now in the last three trading sessions, we have seen some renewed selling pressure in the stock. In this last few trading sessions, we have seen a lot of short positions getting built up in HDFC.\"\"The overall trend for HDFC still remains weak and we are expecting the stock to test Rs 1,120-1,100 levels in the short-term. So, any pullback towards Rs 1,145-1,148, it can be used to initiate short positions keeping a stop loss of Rs 1,160. Target will be Rs 1,120-1,100,\" he added.\" TVS Motor   is languishing in a range of Rs 260-295 for the last couple of weeks. Now, the stock is adding short positions. Today, it has added almost 3 percent of shares in open interest which is again on the short side. So, overall, we are expecting that this stock will again continue to trade with a negative biasness and again come to the lower end of this range which is around Rs 268-265 levels. So, at current level, one can go short keeping a stop loss of Rs 288 and target of Rs 268.\"\"We are seeing some short positions getting built up in  Tata Steel  . So, we expecting the selling pressure may continue and the stock may come towards Rs 215 levels. So, at current level, one may go short keeping a stop loss of Rs 237 and target of Rs 215.\"\" Sun Pharma  is one stock which is seeing a lot of buying interest at lower levels. Today, the stock has added almost 4 percent shares in open interest, in yesterday’s session also, we saw some long positions getting built up at lower levels. So, we are expecting that Sun Pharma would test Rs 890-895 levels in the short-term. We are recommending to buy a Call option-860 Call option at current level with a target of Rs 44 and stop loss will be Rs 18.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-10 12:37:00", "image_url": "http://www.moneycontrol.com/news_image_files/2016/356x200/h/HDFC_1558_356.jpg", "description": "Aditya Agarwal of Way2Wealth Securities is of the view that one can short HDFC, TVS Motor and Tata Steel.", "title": "Short HDFC, TVS Motor, Tata Steel: Aditya Agarwal  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Emkay's research report on  ABB ABB Q4CY15 operational results exceeded our expectations - (i) 8.3% YoY growth in revenues to Rs24bn and (ii) 280bps YoY improvement in EBIDTAM to 10.9%. Order intake decline by 17%YoY to Rs20bn. Base orders increase by 10% YoY. Order flow from renewables and railways more than double during CY15. Localization strategy yielding results MaintainBuy Larger share of ABB revenues is derived from products and the company’s exposure to important sectors like T&D, renewable power, railways and industrials would benefit the company during the early to mid-cycle capex. We expect ABB to post 11% revenue CAGR (CY14-18E) and 39% PAT CAGR (CY14-18E). At the CMP, the stock trades at 28xCY18E earnings. We recommend Buy with a target price of Rs1407 based on 35xCY18E earnings. \nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-09 17:28:00", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/a/ABB_2145_356.jpg", "description": "Emkay is bullish on ABB has recommended buy rating on the stock with a target price of Rs 1407 in its research report dated February 8, 2016.", "title": "Buy ABB; target of Rs 1407: Emkay  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Prabhudas Lilladher's research report on  Bharat Forge With export sales recording a second successive quarter of YoY decline, BHFC’s revenues declined 12.2% YoY and 5.8% QoQ. But with a favourable product mix, cost control measures and low commodity prices, EBITDA margin was robust at 30.2% (higher 140bps QoQ and flat YoY). Standalone adjusted profit in Q3FY16 was as expected at Rs1.7bn, a decline of 13.9% YoY. Medium‐term and long‐term outlook for BHFC remains healthy and its strategy for Aerospace, Defence and Auto transmission parts provides reason for optimism. In the near‐term, benefits for India CV recovery and increase in sales of the PV segment would be balanced by Oil & Gas sector slowdown and sluggish North American truck demand. H2FY16 is likely to be subdued for BHFC, with a better performance outlook from FY17 onwards. We lower our estimates to factor in the lower‐than‐expected revenue growth and weaker subsidiary performance by 7.2%/8.5% for FY16/17e. At the current market price, the stock is trading at 23.8x FY16e EPS and 19.5x FY17e. We maintain “BUY” with a price target of Rs990.\nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-10 16:40:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/bharat_forge_16x9_4601_356.jpg", "description": "Prabhudas Lilladher is bullish on Bharat Forge has recommended buy rating on the stock with a target price of Rs 990 in its research report dated Februrary 9, 2016.", "title": "Buy Bharat Forge; target of Rs 990: Prabhudas Lilladher  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Motilal Oswal's research report on  Ramco Cements Ramco Cement’s (TRCL) 3QFY16’s volume de-growth reduced from double digit level of previous 5 quarters to 5.4%YoY (-5% QoQ) to 1.63mt led by broader stabilization in south market and base effect. Realizations were resilient at 0.5% QoQ. With marginal contribution from wind power business, revenue stood at INR8.1b (3.3%YoY, -7% QoQ).TRCL offers strong play on southern recovery due to (a) superior brand, (b) edge over cost efficiencies, and (c) visibility of deleveraging (stared in FY16). Our assumption of 6% volume and 4% price CAGR to drive 15%/22% EBITDA/PAT CAGR for TRCL in FY16-18. We upgrade FY16- 18 EBITDA by 6-12% to factor in better price, volume and cost. The stock trades at 9.3x/7.2x FY17E/18E EV/EBITDA, and EV/ton of USD97. We maintain Buy with a TP of INR450, an upside of 20% (valuing cement business at 8.5x FY18E EBITDA, EV/ton of USD105). \nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-10 16:40:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/Buy_16-9_356x200_4914_356.jpg", "description": "Motilal Oswal is bullish on Ramco Cements has recommended buy rating on the stock with a target price of Rs 450 in its research report dated Februrary 9, 2016.", "title": "Buy Ramco Cements; target of Rs 450: Motilal Oswal  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Prabhudas Lilladher's research report on  Dabur Dabur has reported 2.5% decline in standalone volumes led by sales decline in Foods (Supply Disruption in Nepal), Honey/ Chyawanprash (late winters and Patanjali’s competition) and Digestives (unorganised competition). Lower input costs and 56% higher other income enabled 12.6% PAT growth. Dabur is looking at sustaining innovations to compete with Patanjali but expects market for herbal products to expand providing enough room for growth. Dabur is looking at base case volume growth of 5%, however monsoons and rural stimulus can accelerate it significantly. IBD growth will be led by Namaste, GCC remains a little uncertain due to political and currency related challenges. We are Cutting FY17 and FY18 EPS estimates by 6.7‐8.5% to factor in the impact of lower sales growth and competition and arrive at 13.5% PAT CAGR over FY16‐18. Maintain Buy\nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-10 14:29:00", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/d/Dabur_356x200_4232_356.jpg", "description": "Prabhudas Lilladher is bullish on Dabur has recommended buy rating on the stock with a target price of Rs 292 in its research report dated January 28, 2016.", "title": "Buy Dabur; target of Rs 292: Prabhudas Lilladher  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Prabhudas Lilladher's research report on  Bharat Elec Bharat Electronics (BEL) revenues disappointed while margins surprised on the positive side. BEL reported sales of Rs15.2bn, down 5.7% YoY (PLe: Rs18.5bn). The weak execution was due to a combination of delayed vendor dispatches as well as inventory increases due to delay in pick up by few clients. Major projects supplied during the quarter include Akash Missile System( Airforce, Army), Fire control System, 3D Tactical Control Radar, Low Level Light Weight radar, Gigabit Ethernet based Ship Data Network, L band Radar for exports. BEL reported EBITDA of Rs2.9bn, up 5.2% YoY (PLe: Rs2.8bn) and margins improved by 200bps to 19.3% due to better mix. Other income was up 19% YoY to Rs1.4bn and Adj. PAT was up 8.8% YoY to Rs2.9bn (PLe: Rs2.5bn). The stock is trading at 21.3x FY17E earnings. We believe BEL will be the prime beneficiary of government focus on modernization of current fleet and procurement of new capital equipments. Increased focus on R&D, move towards being system integrator and increased focus outsourcing are steps in right direction to increase long term sustainability of business. We continue to believe BEL offers good investment opportunities to investors who want to invest in the Indian Defence sector with a long‐term view. We expect stock to deliver earnings CAGR of 12% over FY14‐17E. Maintain ‘Accumulate’. \nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-10 14:29:00", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/b/Bharat_Electronics_BEL_4247_356.jpg", "description": "Prabhudas Lilladher is bullish on Bharat Elec Ind has recommended accumulate rating on the stock with a target price of Rs 1353 in its research report dated January 28, 2016.", "title": "Accumulate Bharat Elec; target of Rs 1353: Prabhudas Lilladher  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Rahul Shah, Associate VP, Equity Advisory Group at Motilal Oswal told CNBC-TV18, \" Eicher Motors  has done quite well post numbers and we have seen a long position also getting added in the stock. So, I would buy Eicher Motors with a stop loss of Rs 17,800 with a target of Rs 18,500.\"\" Pidilite Industries   is holding around almost at closer to the new highs. Still the stock look quite attractive. So, keep a stop loss of Rs 578 and a target of Rs 615 and go long,\" he said.\" Just Dial   has been consistently showing a negative trend since the last couple of series. So, still there is lot of room for downside from current level as well. So, I would short Just Dial from current level with a stop loss of Rs 520 and target of Rs 460.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-10 15:06:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/s/stocks_16-9_356x200_5006_356.jpg", "description": "Rahul Shah, Associate VP, Equity Advisory Group at Motilal Oswal is of the view that one can buy Eicher Motors and feels that one can short Just Dial.", "title": "Buy Eicher Motors; short Just Dial: Rahul Shah  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}CNBC-TV18's Agam Vakil lists some of the key stocks which were buzzing in trade today.\nWatch video for more.. $(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-10 16:00:00", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/a/agamvakil_356_200_3802_356.jpg", "description": "CNBC-TV18's Agam Vakil lists some of the key stocks which were buzzing in trade today.", "title": "Stocks that were buzzing in trade today  - Moneycontrol.com"},
{"content": "\n\n\n\n\n\n\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Motilal Oswal's research report on  Suprajit Eng Suprajit's 3Q is not comparable as Phoenix has been consolidated this quarter while we do not have comparable numbers from the prior period. Standalone revenues have risen 13%, EBITDA is up 24% while profits are up 27%. Consolidated results have recieved a boost from Phoenix acquisition with 60% revenue growth and 88% profit growth. Gross margin expansion aided 60bps rise in EBITDA margins, while standalone margins have risen 170bps. Acquisition cost of INR1cr is factored into 3Q earnings, while INR7cr of gains on MF sales are also factored in. Numbers are higher than our estimates and we have raised FY16 earnings by 10%.\nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-10 15:34:00", "image_url": "http://www.moneycontrol.com/news_image_files/2016/356x200/s/suprajitengg_autocable_356_4242_356.jpg", "description": "Motilal Oswal is bullish on Suprajit Eng has recommended buy rating on the stock with a target price of Rs 190 in its research report dated Februrary 10, 2016.", "title": "Buy Suprajit Eng; target of Rs 190: Motilal Oswal  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Ambareesh Baliga, Market Expert told CNBC-TV18, \"In Dr Reddy's Laboratories  , clearly the corporate governance issues are still playing out. You still have the USFDA issue playing out. So, we could still see further lower levels. We saw a decent bounce back post the results but then we should see levels of closer to about Rs 2,650.\" \" HDFC  , along with the other financials is falling in tandem. However, this is an evergreen stock. Whenever there is a decent correction, I think that is an opportunity to buy. However, just keep a watch, wait for a while and possibly buy at lower levels. It can see levels of about Rs 1,050-1,060,\" he said.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-10 15:50:00", "image_url": "http://www.moneycontrol.com/news_image_files/2016/356x200/h/HDFC_1558_356.jpg", "description": "Ambareesh Baliga, Market Expert is of the view that Dr Reddy's Labs may head lower and feels that one can buy HDFC on dips.", "title": "Dr Reddy's Labs may head lower, buy HDFC on dips: Ambareesh Baliga  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Motilal Oswal's research report on  Aarti Drugs Revenues at INR 265cr, +2% YoY were 3% lower than our estimate of INR 273cr. Although the company increased its capacity specifically in metformin, during the current quarter, it did not have any impact on revenue as most of it is exported to nations in Africa and Middle East which have witnessed a demand slowdown due to decline in crude oil prices. Thus exports for the company witnessed a double digit decline. Slowdown is particularly observed in case of governments of many of these nations who are curbing imports and depleting their inventories. However domestic revenues which form 60% of the overall topline, recorded double digit growth. EBITDA at INR 43.1cr is lower by 1% YoY and is 6% below our estimate of INR 45.8cr. EBITDA margins at 16.3% were 60bp lower YoY. PAT at INR 17.0cr declined 23% YoY which is 10% below our estimate of INR 18.9cr. Higher tax rate of 25% in the current quarter against 16% in 3QFY15 impacted PAT growth. PBT growth stood at -13%. The company is likely to witness gradual improvement in topline growth from 4QFY16 onwards when it starts the sale of high value products initially in the anti-diarrheal and anti-diabetic segment viz. metformin and later in anti-biotics. We believe FY17E topline growth will recover to 15% which should translate into 22% growth in profits on the back of higher operating leverage. Aarti Drugs is a high quality proxy play on the pharma industry. The company is climbing higher in the API value chain by selectively expanding into those APIs which are being currently imported and are of higher value. Based on the below expected performance in 3QFY16, we reduce our earnings estimates for the company by 11%/ 17% for FY16/17E. Despite this we expect the company to grow its profits at 20% CAGR over FY16-18E. We value Aarti Drugs at 18x Sep 2017E EPS which is a 20% discount to the mean multiple commanded by formulation companies and maintain our BUY rating on the stock with a target price of INR 705/share (earlier INR 800) \nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-10 15:33:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/buy2_16-9_356x200_0518_356.jpg", "description": "Motilal Oswal is bullish on Suprajit Eng has recommended buy rating on the stock with a target price of Rs 705 in its research report dated Februrary 10, 2016.\r\n", "title": "Buy Aarti Drugs; target of Rs 705: Motilal Oswal  - Moneycontrol.com"},
{"content": "\n\n\n\n\n\n\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}To tap the upbeat investor sentiments, as many as seven small and medium enterprises ( SME  s) have filed draft papers to float their initial public offerings this year.\r\nThe shares will be listed on the  SME   platforms of the Bombay Stock Exchange (BSE) and National Stock Exchange (NSE).\r\nSince the beginning of 2016, seven companies have filed draft documents to collectively mop up about Rs 34 crore through their IPOs, according to an analysis.\r\nFour firms - Sysco Industries, Kranti Industries, Raghav Ramming Mass and AGI Hospitalities - filed papers to launch their IPOs on BSE's  SME   platform, while Globe International Carriers, HEC Infra Projects and Artemis Electricals plan to list on NSE Emerge.\r\nThese companies are from sectors such as logistics services, automotive components, infrastructure and hospitality, among others.\r\nAccording to market experts, increasing number of firms coming on  SME   exchanges send positive signals and lend a lot of confidence to  SME   capital markets.\r\n\"Listing will help them enter capital markets and finally to graduate on to mainboard,\" Hem Securities Director Gaurav Jain said.\r\n\"We are looking forward to a number of IPOs from different cities in the next 6-8 months, which will join the club of listed companies. It will send a positive signal to other  SME  s which are keen to tap the capital markets,\" he added.\r\nIn 2015, 43 companies were listed to garner about Rs 327 crore from  SME   platforms.\r\nBSE and the National Stock Exchange (NSE) had launched  SME   platforms in March 2012, becoming the only two bourses to offer such a segment in the country. Since then, several companies have got listed on them and some have even shifted to the mainboard.\r\nThe platform provides opportunity to  SME entrepreneur  s to raise equity capital for growth and expansion. It also provides immense opportunity for investors to identify and invest in good  SME  s at an early stage.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-10 16:10:00", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/i/ipo1_1932_356.jpg", "description": "The shares will be listed on the SME platforms of the Bombay Stock Exchange (BSE) and National Stock Exchange (NSE).", "title": "Seven SMEs file draft papers in 2016 to launch IPOs  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}Pankaj Jain of SW Capital told CNBC-TV18, \"If you talk on a fundamental basis,  Housing Development and Infrastructure   (HDIL) comes out with its quarterly results on February 13 and even the last quarter results were pretty steady, not all that strong. One of the better real estate companies operating in the part of India and if we are seeing some bit of green shoots in the commercial space, if that is any reflection, I don’t know where the market will settle around but if we talk about stocks as such, HDIL is one of the better plays at current valuations.\"\"So you can stay with the stock for the next one year, I have deeper stoploss for this stocks and I believe that in the next three-six months, we could see gains of about 20-25 percent from current valuations in HDIL. So as of now, don’t worry about what is happening in the market, let the storm pass by but I think HDIL, at current valuations, is one of the stocks you should stand by,\" he added.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-10 15:15:00", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/h/hdil_356_5443_356.jpg", "description": "Pankaj Jain of SW Capital is of the view that one may stay invested in Housing Development and Infrastructure (HDIL).", "title": "Hold HDIL, says Pankaj Jain  - Moneycontrol.com"},
{"content": "\n.clear_cls{};.td_cls{border: 1px solid black;padding: 15px;}.ml35_cls{margin-left: 35px;}SP Tulsian of sptulsian.com told CNBC-TV18, \"Let me be very blunt in saying that 95 percent of the experts were bullish on  Interglobe Aviation   which is generally happening with IPOs and let me tell you IPO is a big trap. The valuations are looking good because  SpiceJet   and  Jet Airways   has not corrected in that proportion. So, looking to the relative wise basis probably now, IndiGo looks good at the current scenario.\"Interglobe Aviation closed at Rs 768.50, down Rs 20.00, or 2.54 percent. It has touched a 52-week low of Rs 749.00.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "2016-02-10 15:55:00", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/i/indigo_356x200_4752_356.jpg", "description": "SP Tulsian of sptulsian.com is of the view that Interglobe Aviation looks good.", "title": "Interglobe Aviation looks good, says SP Tulsian  - Moneycontrol.com"}]