[{"content": ".KRChoksey's research report on  Minda Industries In Q3FY16, Minda Industries Ltd (MIL) reported net sales of INR 6,257mn which is line of our estimates of INR 6189mn, increased by 12.7% y-o-y and decreased by 4.0% q-o-q. EBIDTA stood at INR 589 Mn(our estimates of INR 564mn) and EBIDTA margins of 9.4 % respectively. In Q3FY16, growth in EBITDA is about 45.2% y-o-y and de-growth of 6.8% q-o-q. Adjusted PAT stood at INR 292Mn which is higher than our estimates of INR 271mn. PAT saw a growth of 123.4% y-o-y and 10.5% q-o-q for Q3FY16 respectively.MIL has market leader in switch gear segment. We believe MIL has potential for growth because of its better capacity utilization, tie up with global brands, innovative portfolio and large order inflow. The stock is currently trading 10.8x its FY 18E EPS of INR 82.1 respectively. We are valuing company 12x its FY18e EPS of INR 82.1 and arrived at a target price of INR 985 and recommend “accumulate” rating on the stock with a potential upside of 11.17% from current levels.\nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "09 Feb,2016 1732hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/buy3_16-9_356x200_0652_356.jpg", "description": "KRChoksey is bullish on Minda Industries Ind has recommended buy rating on the stock with a target price of Rs 985 in its research report dated February 4, 2016.", "title": "Buy Minda Industries; target of Rs 985: KRChoksey  - Moneycontrol.com"},
{"content": ".Axis securities's research report on  Hexaware Tech Hexaware’s Q4CY15 performance was lower than our estimates. Revenue growth and margin were largely impacted due to furloughs, calendar effect (lower working days), and Chennai floods. Outlook and strategy: Management is targeting to grow higher than industry (NASSCOM: 10-12%) in CY16 (Q1 and Q4 are seasonally soft quarters). Confidence stems from strong deal wins (total contract value: USD 120 mn) in CY15 which lends revenue visibility. However, margin will be similar to CY15 (EBITDA: ~17%). Hexaware’s strategy, \"Shrink IT, Grow Digital\" is targeted at large clients and has seen early signs of success around IMS, BPO and Testing in its recent wins. Management indicated effort savings of 30-50% in IMS and BPO can be achieved.We expect USD revenue CAGR of 13% overCY15-17E. Our EPS for CY16E/17E stands at Rs 15.7/ 18.2. Our target price of Rs 252 (16x CY16E) implies 7% upside from CMP of Rs. 235; hence we reduce our rating to HOLD (BUY earlier). The stock trades at 15x/13x CY16E/CY17E EPS.\nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "09 Feb,2016 1729hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/h/Hexaware365_3604_356.jpg", "description": "Axis securities has recommended hold rating on Hexaware Tech with a target price of Rs 252 in its research report dated February 8, 2016.\r\n", "title": "Hold Hexaware Tech; target of Rs 252: Axis securities  - Moneycontrol.com"},
{"content": ".Axis securities's research report on  Guj State Petro GSPL’s Q3FY16PAT at Rs 1.2bn was higher than our estimate (Rs 1.1bn) due to higher other income at Rs 0.3 bn (Rs 0.1 bn expected)on Rs 180 mn  dividend   income from Gujarat Gas (26% stake). Gas volume at 25.1 mmscmd was marginally higher QoQ due to higher supplies to power plants. Transportation tariffs at Rs 1.05/mscm was flat QoQ. Higher tariffs, volumes to drive earnings:We expect GSPL’s blended tariffs to increase by ~10% in FY17 as PNGRB^would amend tariff calculation methodology addressing industry concerns. Gas volumes would also pick up, given higher demand from power sector and start-up of Mundra LNG terminal (in FY18). Higher tariffs and volumes todrive 21% EPS CAGR over FY16-18E. Maintain BUY with TP of Rs 160.\nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "09 Feb,2016 1730hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/buy3_16-9_356x200_0652_356.jpg", "description": "Axis securities is bullish on Guj State Petro has recommended buy rating on the stock with a target price of Rs 160 in its research report dated February 8, 2016.", "title": "Buy Guj State Petro; target of Rs 160: Axis securities  - Moneycontrol.com"},
{"content": ".Religare's research report on  Divis Labs DIVI reported below-expected Q3 results due to deferred shipments to Q4 (normalisation on track) and a 120bps QoQ contraction in margins to 37.8% (RCMLe 38.9%). While Q3 was soft, we believe the additional capex of Rs 7.5bn (incl. Rs 2.5bn for expansion of Vizag EOU) announced by the company lends strong growth visibility over the next three years, supporting a 23% earnings CAGR over FY15-FY18E. Retain BUY with a Mar’17 TP of Rs 1,305 (unchanged upon rolled over from Sep’16).While Q3 was soft, we remain bullish on DIVI as the newly announced capex of Rs 7.5bn imparts strong growth visibility for the next 2-3 years. Maintain BUY.\nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "09 Feb,2016 1731hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/buy3_16-9_356x200_0652_356.jpg", "description": "Religare is bullish on Divis Labs Ind has recommended buy rating on the stock with a target price of Rs 1305 in its research report dated February 8, 2016.", "title": "Buy Divis Labs; target of Rs 1305: Religare  - Moneycontrol.com"},
{"content": ".Axis securities's research report on  ABB ABB’s Q4CY15revenue at Rs24bnwasin line withour expectation of Rs24bn. EBITDA margin improved 290 bps YoYand beat our estimate by 180 bps. PAT at Rs1.3bn was 17% above our estimate on higher EBITDA (20% beat)offset somewhat by higher tax rate (38%) during the quarter. Order inflow at Rs20.6bndeclined by17% YoYdue to lack of large orders from conventional sectors, however base orders grew by ~10% YoY. Management indicated that demandfrom conventional sectors (steel, cement, etc.) and exports remainedweak (declined to ~12% of sales from ~17% in CY14), however impact was offset by growth from new sectors such as renewables, railways, etc. as well as growth in opex- driven services business (~Rs 10 bn in CY15).We cut our CY16 revenue growth to 10% (vs14% earlier) due to lower than expected order inflow in Q4 and flat order backlog YoY. Accordingly, we cutour CY16 EPS to Rs24 (Rs27 earlier).We introduce our CY17E EPS at Rs 30. Our TP stands atRs 1,213 (40x CY17E).\nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "09 Feb,2016 1730hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/a/ABB_2145_356.jpg", "description": "\r\nAxis securities has recommended hold rating on ABB with a target price of Rs 1213 in its research report dated February 8, 2016.\r\n", "title": "Hold ABB; target of Rs 1213: Axis securities  - Moneycontrol.com"},
{"content": ".Axis securities's research report on  Zydus Wellness Zydus’ Q3 net sales at Rs1.1 bn was up 3% on a like-to-like basis (Q3’15 had Rs 223 mn additional excise duty credit from prior periods), below our estimate of 6%. The company cited a challenging demand environment and weakness in the face-wash category as the reasons for subdued growth. Gross margin was up 290 bps YoY on like-to-like basis, driven by favorable input prices. EBITDA margin at 21.7% was up 40 bps YoY. PAT at Rs 273 mn was below our estimate of Rs 355 mn. Distribution overhaul benefits have been talked of for several quarters now, but sales have not followed through (10 consecutive quarters of subdued growth). We cut our FY16/17 sales growth to 2%/10%(8%/14% earlier) and EBITDA margin to 23%/24% (24/24.5% earlier). Maintain HOLD with revised TP of Rs 780 (Rs 920 earlier).\nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "09 Feb,2016 1729hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/z/zydus_356_4823_356.jpg", "description": "Axis securities has recommended hold rating on Zydus Wellness Tech with a target price of Rs 780 in its research report dated February 8, 2016.\r\n", "title": "Hold Zydus Wellness; target of Rs 780: Axis securities  - Moneycontrol.com"},
{"content": ".Shubham Agarwal of Motilal Oswal Securities told CNBC-TV18, \"If you look at the charts of  Marico  , the consolidation that was there for the quite some time was a mean reverting band. Yesterday, we did see a breakout happening from this overall zone and that is giving us more confidence that in the near term we will see higher highs getting reported. So, it is very uncorrelated to what is happening to the market as whole and the momentum should continue there.\"\"We are expecting a target of Rs 260 with a timeframe of about a month and a stop loss for the same can be kept at Rs 220,\" he said.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "09 Feb,2016 1206hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/m/Marico365_5751_356.jpg", "description": "Shubham Agarwal of Motilal Oswal Securities expects Marico to test Rs 260.", "title": "Expect Marico to test Rs 260, says Shubham Agarwal  - Moneycontrol.com"},
{"content": ".Axis Direct's research report on  Arvind Arvind’s Q3 consolidated revenue at Rs 21.6 bn (Rs 20.7 bn in Q3FY15) was marginally below our estimate of Rs 22.6 bn. Revenue from textiles at Rs 12.8 bn remained flat due to lower denim volumes. While Brands & Retail grew 12% YoY (Rs 7.4 bn), strong growth in Brands (up 22%) was offset by de-growth in Retail due to Megamart store closures (-16%).EBITDA at Rs 2.8 bn (flat YoY; our est of Rs 3 bn).Textiles margin at 18% (flat YoY), Brands &Retail at 7.6% (up 60 bps).We expect margin to improve on the back of maturing brands, rationalized Megamart stores and ramp up of new garment facility. Maintain BUY:We maintain our FY16E and FY17E EPS at Rs 14 and Rs 19 with SoTP-based TP at Rs 344 based on 7x FY17E EBITDA multiple for Textiles and 15x FY17E EBITDA for Brands & Retail.\nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "09 Feb,2016 1730hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/a/Arvind365_5106_356.jpg", "description": "Axis Direct is bullish on Arvind Ind has recommended buy rating on the stock with a target price of Rs 344 in its research report dated February 8, 2016.\r\n", "title": "Buy Arvind; target of Rs 344: Axis Direct  - Moneycontrol.com"},
{"content": ".Here are stocks that are in news today:\nResults today:  Dr Reddy's Labs  ,  Hindalco Industries  , SAIL, Britannia Industries, Motherson Sumi, Bharat Forge, Apollo Tyres, GAIL (India), CESC, Petronet LNG, Power Finance Corporation, Jubilant Life Sciences, Punjab National Bank, Central Bank of India, Dena Bank, Allahabad Bank, Prestige Estates, Eros International, Shree Renuka Sugars, MOIL, Patel Integrated Logistics, S H Kelkar and Company, Voltamp Transformers, Ashiana Housing, Future Market Networks, Gujarat Fluorochemicals, KSK Energy, National Fertilizers, Plastiblends India, SEAMEC, Sundaram-Clayton, Sunil Hitech Eng, Talbros Engineering, Universal Cables, Viceroy Hotels, Vindhya Telelinks, V-Mart Retail, Archies, Butterfly Gandhimathi Appliances, Deccan Cements, Dhampur Sugar Mills, Dhanuka Agritech, Dredging Corporation of India, GMDC, Indian Toners & Developers, Mandhana Industries, Mangalore Refinery, Mayur Uniquoters, Minda Corporation, Nesco, Nitin Spinners, Omaxe, Oriental Carbon & Chemicals, Panoramic Universal, PSL, Ramco Industries, Ramco Systems, Sonata Software, Ramco Cements, State Trading Corporation of India\n SRF  Q3-Consolidated net profit at Rs 100.6 crore versus Rs 71.40 crore (YoY)-Consolidated total income at Rs 1,097.3 crore versus Rs 1,113 crore (YoY)-Consolidated EBITDA at Rs 227 crore versus Rs 181 crore (YoY)-Consolidated EBITDA margin at 20.7 percent versus 16.2 percent (YoY)\n JK Tyre  Q3-Consolidated net profit at Rs 111 crore versus Rs 91.8 crore (YoY)-Consolidated net sales at Rs 1,598 crore versus Rs 1,826 crore (YoY)\n Repco Home Finance  Q3-Net profit at Rs 38.6 crore versus Rs 30.7 crore (YoY)-NII at Rs 78 crore versus Rs 59 crore (YoY)-Gross NPA at 2.29 percent versus 2.3 percent (QoQ)-Net NPA at 1.36 percent versus 1.4 percent (QoQ)\n Narayana Hrudayalaya  Q3-Consolidated net profit at Rs 3.7 crore versus loss of Rs 14.1 crore (YoY)-Consolidated total income up 16.7 percent at Rs 398.1 crore versus Rs 341.3 crore (YoY)\n Atul Auto  Q3-Net profit at Rs 16 crore versus Rs 11.3 crore (YoY)-Total income at Rs 151.7 crore versus Rs 139.3 crore (YoY)\n Bombay Dyeing  Q3-Net loss at Rs 78.1 crore versus loss of Rs 66 crore (YoY)-Total income at Rs 335.5 crore versus Rs 515.5 crore (YoY)\n Hitachi Home  Q3-Net profit at Rs 0.8 crore versus Rs 1.6 crore (YoY)-Total income at Rs 284.1 crore versus Rs 224.3 crore (YoY)\n Nectar Life  Q3-Net profit at Rs 17.4 crore versus Rs 16.9 crore (YoY)-Total income at Rs 397.3 crore versus Rs 444.4 crore (YoY)\n Monsanto  Q3-Net profit at Rs 40.8 crore versus Rs 48.3 crore (YoY)-Total income at Rs 154 crore versus Rs 134 crore (YoY)\n TV Today  Q3-Net profit at Rs 36.9 crore versus Rs 26.3 crore (YoY)-Total income at Rs 149.7 crore versus Rs 126.7 crore (YoY)\nCognizant Q4-Revenue at USD 3.23 billion versus USD 3.18 billion (QoQ)-Net income at USD 423.4 million versus USD 397.2 million (QoQ)-Non-GAAP operating margin at 19.6 percent versus 19.4 percent (QoQ)-Non-GAAP EPS at USD 0.80 versus USD 0.76 (QoQ)-GAAP EPS at USD 0.69 versus USD 0.65 (QoQ)\n GSK Consumer  Q3-Net profit at Rs 131.8 crore versus Rs 96.4 crore (YoY)-Total income at Rs 1,029.5 crore versus Rs 1,012.5 crore (YoY)\n PTC India Financial  Q3-Net profit at Rs 69.4 crore versus Rs 54.8 crore (YoY)-NII at Rs 102.2 crore versus Rs 84 crore (YoY)-Gross NPA at 3.77 percent versus 4.07 percent (QoQ)\n Usha Martin  Q3-Consolidated net loss at Rs 85.2 crore versus loss of Rs 71.8 crore (YoY)-Consolidated total income at Rs 859.7 crore versus Rs 888.4 crore (YoY)\n SPML Infra  Q3-Net profit at Rs 0.3 crore versus Rs 7.6 crore (YoY)-Total income at Rs 226.7 crore versus Rs 301.4 crore (YoY)\n Genus Power  Q3-Net profit at Rs 18.7 crore versus Rs 14.6 crore (YoY)-Total income at Rs 204.6 crore versus Rs 211.3 crore (YoY)\n Sanghvi Forging  Q3-Net loss at Rs 1.9 crore versus loss of Rs 0.4 crore (YoY)-Total income at Rs 18.4 crore versus Rs 25.7 crore (YoY)\n Lypsa Gems  Q3-Net profit at Rs 6 crore versus Rs 4.3 crore (YoY)-Total income at Rs 139.2 crore versus Rs 153 crore (YoY)\n ENIL  Q3-Consolidated net profit down 18 percent at Rs 26.9 crore versus Rs 32.8 crore (YoY)-Consolidated total income up 23 percent at Rs 143.5 crore versus Rs 116.7 crore (YoY)-Consolidated EBITDA up 13 percent at Rs 50 crore versus Rs 44 crore (YoY)-Consolidated EBITDA margin at 34.6 percent versus 37.7 percent (YoY)\n Gujarat Gas  Q3-Net profit at Rs 20.13 crore versus Rs 443.5 crore (YoY)-Total income at Rs 1,484.5 crore versus Rs 9,006 crore (YoY)\r\nJanuary auto sales:  Tata Motors -JLR total sales up 24 percent at 46,016 units versus 37,137 units (YoY)-Jaguar sales up 44 percent at 7,941 units versus 5,505 units (YoY)-Land Rover sales up 20 percent at 38,075 units versus 31,632 units (YoY) Jaiprakash Power   may consider signing standstill agreement with FCCB (foreign currency convertible bonds) holdersJaiprakash Power says may require time to repay FCCBs in full\nTelecom companies ( Bharti Airtel  ,  Idea Cellular   etc) in focus-TRAI issues notification on differential pricing-TRAI says no company to offer/charge discriminatory tariffs for data on basis of content-No company to enter into any arrangement based on discriminatory pricing-Financial disincentives of Rs 50,000-50 lakh if TRAI regulations violated\nOther stocks and sectors that are in news today:-Government may allow infrastructure companies to file consolidated group tax returns: ET- OBC  to consider raising up to Rs 1500 crore via preferential issue to government & LIC on February 11- Reliance Infrastructure  board approves merger of arm Reliance Concrete with company-Tata Marcopolo Motors declares lockout at Dharwad plant- HCL Tech , MS launch internet of things incubation centre$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "09 Feb,2016 0848hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/n/Nifty-Stocks_16-9_356x200_5118_356.jpg", "description": "Stocks in news,Dr Reddys Laboratories,Hindalco Industries,SRF,JK Tyre and Industries,Repco Home Finance,Narayana Hrudayalaya,Atul Auto,Bombay Dyeing and Manufacturing Company,Hitachi Home & Life Solutions,Nectar Lifesciences,Monsanto India,TV Today Network,GlaxoSmithKline Consumer Healthcare,PTC India Financial Services,Usha Martin,SPML Infra,Genus Power Infrastructures,Sanghvi Forging and Engineering,Lypsa Gems and Jewellery,Entertainment Network India,Gujarat Gas,Tata Motors,Bharti Airtel,Idea Cellular,Oriental Bank of Commerce,Reliance Infrastructure,HCL Technologies", "title": "Stocks in news: Bharti, Dr Reddy's, ENIL, Gujarat Gas, Atul Auto  - Moneycontrol.com"},
{"content": ".Jai Bala of Cashthechaos.com told CNBC-TV18, \" ICICI Bank   and  State Bank of India   together are a problem for the market, that is what is holding back the market. We want both these stocks to pickup and once the banking index were to cross above 15700 it would be because both these stocks have stabilised. Both of them are still in a problem zone. It is looking like it is trying to stabilise but it is not yet picking up but we want that to happen for the overall health of the market.\"He further added, \" Maruti Suzuki   has had a stellar run from 2012. So, it is a very welcome correction. I think the correction is still ongoing. There is still little bit of downside left for the stock. It will come somewhere close to Rs 3300-3400 and stabilise somewhere around there. Then post that it will go to record highs but you have got to be patient for this stock to correct a bit more, don't get impatient and try to pull the trigger here. It has corrected quite a bit but still there is a small bit of downside to be done for the stock in the short term. I think that will be stabilising around Rs 3300-3400.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "06 Feb,2016 1227hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/m/maruti356x200_4526_356.jpg", "description": "Jai Bala of Cashthechaos.com feels that Maruti Suzuki may slip to Rs 3300-3400.", "title": "Maruti Suzuki may slip to Rs 3300-3400, says Jai Bala  - Moneycontrol.com"},
{"content": ".Ahead of its IPO, which opens on Monday, software provider Quick Heal Technologies has raised Rs 133.9 crore through issue of shares to 10 anchor investors, including BNP Paribas Advantage and Reliance MF. Quick Heal has alloted 41.70 lakh equity shares at Rs 321 apiece, the upper end of the price band, to 10 anchor investors. The anchor investors include foreign investors -- Driehaus Emerging Markets Smallcap Growth Fund, Nomura India Stock Mother Fund, BNP Paribas Advantage and Jupiter India Fund.\r\nBesides, ICICI Prudential MF, Birla Sun Life Insurance, Reliance MF, Sundaram MF, Axis MF and Reliance Life Insurance are among the domestic investors. Quick Heal has fixed the price band at Rs 311-321 for its initial public offer (IPO), which will hit the market on February 8. The IPO, which would close on February 10, involves a fresh issue of equity shares by the company.\r\nBesides, the issue consists of an offer for sale of about 62.70 lakh equity shares by promoters Kailash Sahebrao Katkar and Sanjay Sahebrao Katkar, as well as Sequoia Capital India Investment Holdings III. ICICI Securities, Jefferies India and JPMorgan India are the book running lead managers while Link Intime India is the registrar to the public issue. While the proceeds from the offer of sale would not go to Quick Heal Technologies, the Rs 250 crore funds raised from fresh issue of equity shares would be used by the company for advertising and sales promotion and capital expenditure for research and development.\r\nThe proceeds would also be invested to purchase, develop and renovate its office premises in Kolkata, Pune and New Delhi, as well as general corporate needs. The company is a provider of security software products and solutions in India. Quick Heal's equity shares are proposed to be listed on BSE and NSE. $(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "08 Feb,2016 1044hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/q/quickheal_3854_356.jpg", "description": "Ahead of its IPO, which opens on Monday, software provider Quick Heal Technologies has raised Rs 133.9 crore through issue of shares to 10 anchor investors, including BNP Paribas Advantage and Reliance MF. ", "title": "Quick Heal raises Rs 134 cr from anchor investors  - Moneycontrol.com"},
{"content": ".Ashish Kyal, Founder & CEO at wavesstrategy.com told CNBC-TV18, \"One can sell  Maruti Suzuki India   with a stop loss at Rs 3,810 keeping a target of Rs 3,680.\"\"One can also sell  BPCL   with a stop loss at Rs 850 keeping a target of Rs 790.\"$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "08 Feb,2016 1635hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/s/Sell_16-9_356x200_0717_356.jpg", "description": "Ashish Kyal, Founder & CEO at wavesstrategy.com is of the view that one can sell Maruti Suzuki and BPCL.", "title": "Sell Maruti Suzuki, BPCL: Ashish Kyal  - Moneycontrol.com"},
{"content": ".Bull's Eye, CNBC-TV18's popular game show, where market experts come together to dish out trading strategies for you to make your week more exciting and compete with each other to see whose portfolio is the strongest.Remember these are midcap ideas not just for the day, but stocks that look attractive in the medium-term as well. This week, Sarvendra Srivastava, Ruchit Jain and Manish Sharma battle it out for top honours. Below their top stock picks and analysis:Sarvendra Srivastava of phisense.comBuy  Dhampur Sugar   with a stoploss at Rs 65.30 and target of Rs 69.90Sell  Aurobindo Pharma   with a stoploss at Rs 757.60 and target of Rs 721.60Sell  SKS Microfinance   with a stoploss at Rs 572.60 and target of Rs 545.60Sell  Ajanta Pharma   with a stoploss at Rs 1322.60 and target of Rs 1262.60Ruchit Jain of Angel BrokingBuy  Siemens   with a stoploss at Rs 995 and target of Rs 1127Sell  Arvind Future   with a stoploss at Rs 299 and target of Rs 274Buy  Tata Chemicals   with a stoploss at Rs 348 and target of Rs 393Buy  CESC   with a stoploss at Rs 425 and target of Rs 483Manish Sharma of derivativetradingresearch.comBuy  Union Bank of India   with a stoploss at Rs 130 and target of Rs 145Buy  HDIL   with a stoploss at Rs 70 and target of Rs 80Buy  Ceat   with a stoploss at Rs 890 and target of Rs 970Sell  Ajanta Pharma   with a stoploss at Rs 1325 and target of Rs 1250$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "09 Feb,2016 0848hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/b/buy-sell_190_0400_356.jpg", "description": "Ruchit Jain of Angel Broking advises selling Arvind Future with a target of Rs 274.", "title": "Bull's Eye: Buy CESC, HDIL, Siemens; sell Arvind, Ajanta Pharma  - Moneycontrol.com"},
{"content": ".Moneycontrol BureauShares of  Rallis India   rose 2 percent intraday Monday. The company is going to increase its stake in Metahelix Life Sciences from 80.51 percent to 100 percent.Metahelix is a subsidiary of the Company, which will become a wholly owned subsidiary on completion of the acquisition of remaining stake.The company is going to acquire 19.49 percent stake for Rs 73.33 crore.Metahelix had generated profit of Rs 9.23 crore and 16.52 crore in FY13-14 and FY14-15 respectively.At 11:04 hrs Rallis India was quoting at Rs 164, up Rs 3.15, or 1.96 percent on the BSE.Posted by Rakesh Patil$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "08 Feb,2016 1121hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2014/356x200/f/fertilizer_urea_agriculture_356_3533_356.jpg", "description": "Shares of Rallis India rose 2 percent intraday Monday. The company is going to increase its stake in Metahelix Life Sciences from 80.51 percent to 100 percent.", "title": "Rallis India rises 2%; to increase stake in Metahelix Life  - Moneycontrol.com"},
{"content": ".Religares research report on Automobile sectorThe 13th Auto Expo being held in Greater Noida (5-9 Feb) seems to have set the stage for combat in relatively niche 4W segments, especially compact sedans and SUVs. MSIL was the showstopper with its Vitarra Brezza and new concept Ignis, whereas Honda and TTMT also showcased some promising products. While the expo was largely a non-event for 2Ws, HMSI, TVS and UM did come up with new launches, and HMCL with more refreshes. In all, we think 4Ws will be driven by new products in 2016, with more novel, energy-efficient, and competitively-priced models on offer. The stage is also set for a 2W recovery in FY17, with a low base and multiple triggers ahead. For 2W players, the expo was a non-event with only refreshes of products, particularly for HMSI (Splendor I smart), though TVS did showcase its Victor bike and concept Akula 310 (likely launch from BMW collaboration), and BMW its G310 bike. BJAUT/RE were conspicuous by their absence, though both have already launched their new products V/Himalayan before the expo. HMSI however was one of the few 2W player’s to launch a new product, and unveiled Navi – an automatic scooter + motorcycle at Rs 39,000. While the product targets the youth, we found its positioning a bit confusing. A key surprise was UM Motorcycles foraying into India with the launch of Renegade Commando at Rs 159,000-169,000. While the bike looks promising, UM’s limited network and initial capacity of 3000/month is unlikely to move rivals. Most 2W players also showcased e-bikes, including Genze/Duet E by MM/HMSI. \nFor all recommendations,  click here   Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.$(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "09 Feb,2016 1729hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/a/automobile_0248_356.jpg", "description": "Religare has come out with its report on Automobile sector. According to the research firm, In all, we think 4Ws will be driven by new products in 2016.", "title": "Auto Expo’16: It’s raining UVs: Religare  - Moneycontrol.com"},
{"content": ".Precision Camshafts, which completed a Rs 240-crore public offer later last month, will list its shares on stock exchanges tomorrow. The company's share sale programme was the first initial public offering of 2016. The Solapur, Maharashtra-based Precision Camshafts manufactures and sells over 150 types of camshafts for small and mid-sized passenger vehicle engines to a large number of companies, including some overseas OEMs. In separate circulars, both BSE and NSE said effective Monday, (February 8), the equity shares of Precision will be listed and traded on the exchanges. The Rs 240-crore public float, which closed on January 29, was subscribed by 1.89 times at a price band of Rs 180-186 per share. The company had said the proceeds from the issue would be utilised for setting up a machine shop for ductile iron camshafts at its unit at Solapur in Maharashtra, which is being put up for Rs 200 crore, and for other general corporate purposes. The company also plans to set up two more new machine shops for ductile iron camshafts and assembled camshafts by 2018. $(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "08 Feb,2016 0829hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2015/356x200/i/ipo2_5720_356.jpg", "description": "The company's share sale programme was the first initial public offering of 2016.", "title": "Precision Camshafts to make stock market debut today  - Moneycontrol.com"},
{"content": ".Indian ADRs ended lower on Monday. In the banking space, ICICI Bank was down 0.20 percent at USD 5.90 and HDFC Bank fell 1.36 percent at USD 56.82.In the IT space, Infosys slipped 0.80 percent at USD 16.55 and Wipro was down 0.38 percent at USD 11.32.In the other sectors, Tata Motors declined 0.83 percent at USD 23.79 and Dr Reddy's Laboratories shed 0.27 percent at USD 44.58. $(\"<div class='CL'></div>\").insertAfter(\".clear_cls\") ", "date_published": "09 Feb,2016 0822hrs IST", "image_url": "http://www.moneycontrol.com/news_image_files/2016/356x200/w/wall_street_356_5924_356.jpg", "description": "Indian ADRs ended lower on Monday. Infosys slipped 0.80 percent and Tata Motors declined 0.83 percent.", "title": "Indian ADRs: HDFC Bank, Tata Motors, Infosys slip  - Moneycontrol.com"}]